[
  {
    "doctor_vignette": "A 129-year-old male presents with severe abdominal pain localized to the right lower quadrant, accompanied by nausea and a low-grade fever. On physical examination, he exhibits tenderness and rebound tenderness in the right lower abdomen with guarding. Laboratory tests reveal an elevated white blood cell count of 14,000/mm³, and an abdominal ultrasound shows a thickened appendix with surrounding fluid, suggestive of acute appendicitis.",
    "actual_diagnosis": "Acute appendicitis, ICD-10 code K35.2"
  },
  {
    "doctor_vignette": "A 128-year-old male presents with worsening fatigue and intermittent difficulty in speaking over the past month. Neurological examination reveals decreased strength in the right upper extremity and a positive Babinski sign on the right. MRI of the brain shows multiple hyperintense lesions in the periventricular white matter consistent with demyelination. Cerebrospinal fluid analysis reveals elevated oligoclonal bands.",
    "actual_diagnosis": "Multiple sclerosis, ICD-10 code G35"
  },
  {
    "doctor_vignette": "A 100-year-old female presents to the emergency department with sudden onset shortness of breath and chest pain. On physical examination, she is tachypneic with a heart rate of 110 bpm and has decreased oxygen saturation at 85% on room air. A chest CT angiogram reveals a large pulmonary embolism in the right main pulmonary artery. Her D-dimer level is significantly elevated, supporting the diagnosis.",
    "actual_diagnosis": "Pulmonary embolism, ICD-10 code I26.9"
  },
  {
    "doctor_vignette": "A 71-year-old female presents with fatigue and decreased appetite for the past several months. On physical examination, she has bilateral lower extremity edema and pale conjunctiva. Laboratory results reveal an elevated serum creatinine level of 2.5 mg/dL and a glomerular filtration rate (GFR) of 30 mL/min. Urinalysis shows proteinuria and hematuria, indicating underlying kidney dysfunction.",
    "actual_diagnosis": "Chronic kidney disease, ICD-10 code N18.9"
  },
  {
    "doctor_vignette": "A 63-year-old female presents with a chief complaint of bilateral joint pain and stiffness lasting more than six weeks, particularly in her hands and knees. Physical examination reveals swelling, tenderness, and decreased range of motion in the affected joints, along with subcutaneous nodules. Laboratory tests show positive rheumatoid factor and elevated anti-CCP antibodies, alongside a high sedimentation rate indicating inflammation.",
    "actual_diagnosis": "Rheumatoid arthritis, ICD-10 code M06.9"
  },
  {
    "doctor_vignette": "A 48-year-old male presents with a chief complaint of persistent cough and increasing shortness of breath over the past few months. Physical examination reveals digital clubbing, wheezing, and decreased breath sounds bilaterally. A chest X-ray shows bronchiectasis, and sputum analysis reveals a high concentration of salt and the presence of Pseudomonas aeruginosa.",
    "actual_diagnosis": "Cystic fibrosis, ICD-10 code E84.9"
  },
  {
    "doctor_vignette": "A 5-year-old female presents with complaints of fatigue and difficulty concentrating at school. On physical examination, she is noted to have dry skin, thinning hair, and a bradycardic heart rate of 60 beats per minute. Laboratory tests reveal elevated TSH levels of 12 mU/L and low free T4 levels of 0.5 ng/dL, indicating thyroid dysfunction.",
    "actual_diagnosis": "Acquired hypothyroidism, ICD-10 code E03.9"
  },
  {
    "doctor_vignette": "A 12-year-old female presents with complaints of increasing muscle weakness, particularly in her arms and eyelids, which worsens with activity and improves with rest. Physical examination reveals ptosis of the left eyelid and generalized weakness in the proximal muscle groups. A serological test shows positive anti-acetylcholine receptor antibodies, supporting the diagnosis.",
    "actual_diagnosis": "Myasthenia gravis, ICD-10 code G70.0"
  },
  {
    "doctor_vignette": "A 62-year-old female presents with joint swelling and pain in her right knee following a minor fall. Upon examination, there is notable effusion and tenderness in the joint, along with easy bruising on her forearms. Lab results reveal a prolonged activated partial thromboplastin time (aPTT) with normal prothrombin time (PT) and low factor VIII levels, confirming a bleeding disorder.",
    "actual_diagnosis": "Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 114-year-old female presents with sudden onset of severe chest pain radiating to the back. Physical examination reveals a diastolic murmur and a BP differential of 20 mmHg between the arms. A chest X-ray shows a widened mediastinum, and a CT scan confirms an aortic dissection extending from the ascending aorta to the descending aorta.",
    "actual_diagnosis": "Aortic dissection, ICD-10 code I71.0"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with fatigue, joint pain, and a butterfly-shaped rash on her face. Physical examination reveals swelling in her hands and wrists, along with oral ulcers. Laboratory tests show positive antinuclear antibodies (ANA) and elevated anti-double-stranded DNA antibodies.",
    "actual_diagnosis": "Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 117-year-old female presents with weight fluctuations and reports binge eating followed by self-induced vomiting. Physical examination reveals dental erosion and electrolyte imbalances, with a potassium level of 2.8 mEq/L. She expresses significant distress regarding her body image and dietary habits, and has a history of anxiety and depression.",
    "actual_diagnosis": "Bulimia nervosa, ICD-10 code F50.2"
  },
  {
    "doctor_vignette": "An 81-year-old male presents with severe pain in the lower left jaw, exacerbated by chewing. On examination, there is swelling and tenderness over the left mandible, with a noticeable fluctuant mass. Radiographic imaging reveals a periapical radiolucency associated with the affected tooth, indicating an abscess. Vital signs are stable, but the patient shows signs of distress due to pain.",
    "actual_diagnosis": "Tooth abscess, ICD-10 code K04.7"
  },
  {
    "doctor_vignette": "A 79-year-old male presents with a chief complaint of a persistent cough for the past two weeks, associated with mild wheezing and a low-grade fever. On physical examination, there are crackles heard in the lungs and a heart rate of 98 beats per minute. A chest X-ray shows no evidence of pneumonia, and a sputum sample reveals mild bronchial inflammation with no bacterial growth.",
    "actual_diagnosis": "Acute bronchitis, ICD-10 code J20.9"
  },
  {
    "doctor_vignette": "An 88-year-old male presents to the emergency department with sudden onset of sharp right-sided chest pain and shortness of breath. On physical examination, he exhibits decreased breath sounds on the right side and tachycardia. A chest X-ray reveals a large right-sided pneumothorax with mediastinal shift. His vital signs show mild hypotension and increased respiratory rate.",
    "actual_diagnosis": "Pneumothorax, ICD-10 code J93.9"
  },
  {
    "doctor_vignette": "A 57-year-old male presents with fatigue and pallor. On examination, he has a smooth, beefy red tongue and mild jaundice. Laboratory tests reveal a low hemoglobin level of 8.5 g/dL, elevated mean corpuscular volume (MCV) of 110 fL, and a positive intrinsic factor antibody test.",
    "actual_diagnosis": "Pernicious anemia, ICD-10 code D51.0"
  },
  {
    "doctor_vignette": "A 91-year-old female presents with a chief complaint of severe burning pain and redness in her feet, which worsens with warmth and improves with cooling. On physical examination, her feet are warm, red, and swollen, with a notable increase in temperature compared to her legs. Laboratory tests reveal normal complete blood count and metabolic panel, while vascular imaging shows no significant occlusive disease in the lower extremities.",
    "actual_diagnosis": "Erythromelalgia, ICD-10 code G57.0"
  },
  {
    "doctor_vignette": "A 91-year-old female presents with chronic diarrhea and significant weight loss over the past three months. On physical examination, she has a distended abdomen and signs of malnutrition, including muscle wasting and dry skin. Laboratory tests reveal elevated anti-tissue transglutaminase antibodies and a low hemoglobin level indicating anemia. An upper endoscopy shows villous atrophy in the duodenum, consistent with celiac disease.",
    "actual_diagnosis": "Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 90-year-old female presents with complaints of increased abdominal girth and easy bruising over the past six months. Physical examination reveals a rounded face, purple striae on the abdomen, and proximal muscle weakness. Laboratory tests show elevated cortisol levels in a 24-hour urine collection and suppressed ACTH levels.",
    "actual_diagnosis": "Cushing's syndrome, ICD-10 code E24.9"
  },
  {
    "doctor_vignette": "A 74-year-old female presents with recurrent fractures and chronic pain in her lower extremities. Upon physical examination, she displays blue sclera and a history of multiple bone fractures with minimal trauma. X-rays reveal multiple healed fractures and osteopenia. Genetic testing confirms a mutation in the COL1A1 gene, indicative of Osteogenesis imperfecta.",
    "actual_diagnosis": "Osteogenesis imperfecta, ICD-10 code Q78.0"
  },
  {
    "doctor_vignette": "A 93-year-old male presents with dry, scaly skin primarily affecting his lower extremities and trunk, which he reports has worsened over the past year. On physical examination, his skin is noted to be rough, with fine white scales, particularly on the shins and forearms, and he shows no signs of inflammation or infection. A biopsy of the skin reveals a thickened stratum corneum with minimal inflammation, consistent with ichthyosis vulgaris. Laboratory tests show normal serum electrolytes and no signs of systemic disease.",
    "actual_diagnosis": "Ichthyosis vulgaris, ICD-10 code Q81.0"
  },
  {
    "doctor_vignette": "A 116-year-old female presents with a chief complaint of recurrent severe headaches occurring 15 days per month, accompanied by nausea and sensitivity to light. Physical examination reveals tenderness in the pericranial muscles and a normal neurological exam. MRI of the brain shows no acute intracranial pathology, consistent with a diagnosis of chronic migraines.",
    "actual_diagnosis": "Chronic migraines, ICD-10 code G43.709"
  },
  {
    "doctor_vignette": "A 148-year-old male presents with a chief complaint of persistent cough and shortness of breath for the past three days. Physical examination reveals tachypnea, crackles on lung auscultation, and a fever of 102°F. Chest X-ray shows bilateral infiltrates, and rapid influenza diagnostic test is positive for Influenza A.",
    "actual_diagnosis": "Pneumonia due to influenza, ICD-10 code J10.1"
  },
  {
    "doctor_vignette": "An 84-year-old male presents with complaints of persistent fatigue and weight gain over the past six months. On physical examination, he exhibits dry skin, bradycardia, and a delayed relaxation phase of deep tendon reflexes. Laboratory tests reveal an elevated TSH level of 12 mIU/L and a low free T4 level of 0.7 ng/dL.",
    "actual_diagnosis": "Hypothyroidism, ICD-10 code E03.9"
  },
  {
    "doctor_vignette": "A 41-year-old male presents with a chief complaint of sudden, severe pain and swelling in his right big toe, which started overnight. On examination, the toe is erythematous, warm, and exquisitely tender to touch. Serum uric acid levels are found to be elevated at 9.5 mg/dL, and joint aspiration reveals needle-shaped monosodium urate crystals in the synovial fluid.",
    "actual_diagnosis": "Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 70-year-old female presents with a chief complaint of increasing shortness of breath and a chronic cough that has worsened over the past six months. On physical examination, she exhibits wheezing, decreased breath sounds bilaterally, and use of accessory muscles for breathing. A recent chest X-ray shows hyperinflation of the lungs, and pulmonary function tests reveal a significant reduction in FEV1/FVC ratio, confirming obstructive lung disease.",
    "actual_diagnosis": "Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 104-year-old female presents with acute chest pain radiating to her left arm, accompanied by shortness of breath. Physical examination reveals diaphoresis, tachycardia, and a blood pressure of 90/60 mmHg. An ECG shows ST-segment elevation in the anterior leads, and troponin levels are significantly elevated. ",
    "actual_diagnosis": "Acute myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 128-year-old male presents with a chief complaint of severe, throbbing headache that has persisted for the last 24 hours. Physical examination reveals no neurological deficits, and vital signs are stable. The patient reports sensitivity to light and sound but denies any visual disturbances. Routine lab tests and a CT scan of the head show no abnormalities.",
    "actual_diagnosis": "Migraine without aura, ICD-10 code G43.009"
  },
  {
    "doctor_vignette": "A 102-year-old male presents with severe joint pain and stiffness in both hands and knees, worsening in the morning. Physical examination reveals symmetrical swelling and tenderness in the metacarpophalangeal joints and a positive squeeze test. Laboratory tests show elevated rheumatoid factor and anti-CCP antibodies, along with a significantly raised ESR. X-rays demonstrate joint erosion and narrowing of the joint spaces in the affected areas.",
    "actual_diagnosis": "Rheumatoid arthritis, ICD-10 code M05.79"
  },
  {
    "doctor_vignette": "A 52-year-old female presents with progressive weakness and tingling in her legs over the past week, which has now ascended to her arms. On physical exam, she demonstrates decreased muscle strength in all four extremities, with absent deep tendon reflexes. A lumbar puncture reveals elevated protein levels in the cerebrospinal fluid with a normal white cell count. Electromyography shows conduction block, supporting the diagnosis.",
    "actual_diagnosis": "Guillain-Barré syndrome, ICD-10 code G61.0"
  },
  {
    "doctor_vignette": "A 128-year-old female presents with a chief complaint of persistent, itchy, scaly patches on her elbows and knees. Physical examination reveals well-defined erythematous plaques covered with silvery-white scales. No significant findings are noted in laboratory tests, including a complete blood count and metabolic panel. A skin biopsy confirms the diagnosis of psoriasis.",
    "actual_diagnosis": "Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 25-year-old female presents with severe right upper quadrant pain and nausea after a fatty meal. On physical examination, she exhibits tenderness in the right upper quadrant and a positive Murphy's sign. Laboratory tests reveal elevated white blood cell count and liver function tests, while an abdominal ultrasound shows gallbladder wall thickening and pericholecystic fluid, indicating inflammation.",
    "actual_diagnosis": "Cholecystitis, ICD-10 code K81.0"
  },
  {
    "doctor_vignette": "A 26-year-old male presents with complaints of decreased urine output and fatigue over the past three days. Physical examination reveals mild edema in the lower extremities and a blood pressure of 130/85 mmHg. Laboratory results show elevated serum creatinine levels of 3.5 mg/dL and a BUN of 30 mg/dL, indicating impaired kidney function. Urinalysis reveals muddy brown casts consistent with acute tubular necrosis.",
    "actual_diagnosis": "Acute kidney injury, ICD-10 code N17.9"
  },
  {
    "doctor_vignette": "A 57-year-old male presents with fatigue and weakness over the past month. On physical examination, he has pale conjunctiva and a mild tachycardia. Laboratory tests reveal a hemoglobin level of 10.2 g/dL, low ferritin at 10 ng/mL, and increased total iron-binding capacity. No recent gastrointestinal bleeding is noted on history.",
    "actual_diagnosis": "Anemia due to iron deficiency, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "A 42-year-old female presents with a chief complaint of persistent lower back pain following a minor fall. Physical exam reveals tenderness in the lumbar spine and a noticeable loss of height. Bone density testing indicates a T-score of -2.8, consistent with osteoporosis. She has a history of amenorrhea and low calcium intake, contributing factors to her condition.",
    "actual_diagnosis": "Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 93-year-old male presents with a chief complaint of worsening tremors in his right hand over the past six months. Physical examination reveals a resting tremor, bradykinesia, and rigidity in his upper extremities, along with a shuffling gait. His Mini-Mental State Examination score is 24, indicating mild cognitive impairment. MRI of the brain shows no acute abnormalities but confirms age-related changes.",
    "actual_diagnosis": "Parkinson's disease, ICD-10 code G20"
  },
  {
    "doctor_vignette": "An 84-year-old male presents with a chief complaint of persistent cough and unexplained weight loss over the past three months. On physical examination, he has decreased breath sounds in the left lung base and notable lymphadenopathy in the cervical region. Chest X-ray reveals a cavitary lesion in the left upper lobe, and sputum smear shows acid-fast bacilli.",
    "actual_diagnosis": "Tuberculosis, ICD-10 code A15.9"
  },
  {
    "doctor_vignette": "A 100-year-old female presents with worsening muscle weakness, particularly in her eyes and limbs, over the past two months. On examination, she exhibits bilateral ptosis and generalized muscle fatigability. A serological test reveals the presence of acetylcholine receptor antibodies, and a CT scan shows thymic hyperplasia. ",
    "actual_diagnosis": "Myasthenia gravis, ICD-10 code G70.00"
  },
  {
    "doctor_vignette": "A 104-year-old male presents with progressive dyspnea and a persistent dry cough over the past three months. Physical examination reveals diminished breath sounds, clubbing of the fingers, and crackles on lung auscultation. A chest CT scan shows reticular patterns and ground-glass opacities consistent with interstitial lung disease.",
    "actual_diagnosis": "Interstitial lung disease, ICD-10 code J84.9"
  },
  {
    "doctor_vignette": "A 56-year-old female presents with a chief complaint of a persistent dull headache that has lasted for the past week. On physical examination, she exhibits tenderness in the pericranial muscles and normal neurological findings. No significant abnormalities were noted in her routine blood tests or imaging studies, which were unremarkable. She reports increased stress at work and poor sleep quality, contributing to her symptoms.",
    "actual_diagnosis": "Tension-type headache, ICD-10 code G44.209"
  },
  {
    "doctor_vignette": "A 121-year-old male presents with complaints of increased hand and foot size over the past few years. Physical examination reveals prominent facial features including a protruding jaw, enlarged hands, and thickened skin. Laboratory tests show elevated insulin-like growth factor 1 (IGF-1) levels, and an MRI of the pituitary gland reveals a pituitary adenoma.",
    "actual_diagnosis": "Acromegaly, ICD-10 code E22.0"
  },
  {
    "doctor_vignette": "A 9-year-old female presents to the clinic with severe abdominal pain and fatigue over the past two days. On physical examination, she exhibits pallor and tenderness in the abdomen, with a heart rate of 110 bpm. A complete blood count reveals a hemoglobin level of 6.5 g/dL and reticulocyte count is elevated. Peripheral blood smear shows sickle-shaped red blood cells.",
    "actual_diagnosis": "Sickle cell disease, ICD-10 code D57.9"
  },
  {
    "doctor_vignette": "A 69-year-old male presents with a chief complaint of fever and productive cough for the past three days. On physical examination, he has decreased breath sounds and dullness to percussion on the right side, with crackles noted on auscultation. A chest X-ray reveals a right lower lobe consolidation, and sputum culture grows Klebsiella pneumoniae.",
    "actual_diagnosis": "Pneumonia due to Klebsiella pneumoniae, ICD-10 code J15.0"
  },
  {
    "doctor_vignette": "A 22-year-old male presents with mood swings, reporting episodes of extreme elation followed by deep depressive states. During the physical exam, he exhibits a pressured speech pattern and displays signs of psychomotor agitation. No significant lab abnormalities are noted, and a routine urinalysis is unremarkable. There are no imaging studies performed, but the patient's history reveals recurrent mood episodes over the past year.",
    "actual_diagnosis": "Bipolar disorder, ICD-10 code F31.9"
  },
  {
    "doctor_vignette": "A 21-year-old male presents for a routine check-up, reporting fatigue and occasional chest discomfort after exercise. Physical examination reveals a body mass index (BMI) of 28 and xanthomas on his elbows. Lab results show elevated total cholesterol at 290 mg/dL and LDL levels at 180 mg/dL, with a low HDL of 35 mg/dL.",
    "actual_diagnosis": "Hyperlipidemia, ICD-10 code E78.5"
  },
  {
    "doctor_vignette": "A 105-year-old female presents with complaints of aching and heaviness in her legs, particularly after prolonged sitting. Physical examination reveals prominent, tortuous veins in both lower extremities, with significant edema and skin changes in the affected areas. Doppler ultrasound confirms reflux in the great saphenous vein, indicative of chronic venous insufficiency.",
    "actual_diagnosis": "Varicose veins of lower extremities, ICD-10 code I83.90"
  },
  {
    "doctor_vignette": "A 142-year-old female presents with recurrent oral ulcers and painful genital lesions. Physical examination reveals erythematous nodules on her lower extremities and signs of uveitis in her left eye. Laboratory tests show elevated inflammatory markers and a positive pathergy test. Imaging of the eyes confirms retinal inflammation.",
    "actual_diagnosis": "Behçet's disease, ICD-10 code M35.2"
  },
  {
    "doctor_vignette": "A 48-year-old male presents with recurrent joint dislocations and chronic joint pain. On physical examination, he demonstrates hypermobility in multiple joints, particularly in the fingers and elbows, alongside skin that is notably elastic and easily bruised. Genetic testing reveals a mutation in the COL5A1 gene, confirming connective tissue disorder.",
    "actual_diagnosis": "Ehlers-Danlos syndrome, ICD-10 code Q79.6"
  },
  {
    "doctor_vignette": "A 13-year-old male presents with complaints of fatigue and mild abdominal discomfort. On physical examination, he has a slightly enlarged liver and is noted to be overweight with a BMI in the 95th percentile. Laboratory tests reveal elevated liver enzymes (ALT and AST) and an abdominal ultrasound shows hepatic steatosis. ",
    "actual_diagnosis": "Non-alcoholic fatty liver disease, ICD-10 code K76.0"
  },
  {
    "doctor_vignette": "A 148-year-old female presents with complaints of intermittent claudication, experiencing pain in her legs during walking. Physical examination reveals diminished femoral and popliteal pulses, and a notable decrease in ankle-brachial index (ABI) of 0.4. Additionally, her feet appear cold and have a pale coloration. Doppler ultrasound confirms significant stenosis in the superficial femoral artery.",
    "actual_diagnosis": "Peripheral artery disease, ICD-10 code I73.9"
  },
  {
    "doctor_vignette": "An 84-year-old male presents to the emergency department with palpitations and shortness of breath for the past two days. On examination, he is found to have an irregularly irregular pulse at a rate of 130 beats per minute, along with mild bilateral lower extremity edema. An ECG reveals atrial fibrillation with no acute ischemic changes, and a chest X-ray shows mild cardiomegaly.",
    "actual_diagnosis": "Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 99-year-old male presents with increased thirst and frequent urination over the past week. Physical exam reveals weight loss and dry mucous membranes. Laboratory tests show a blood glucose level of 350 mg/dL and positive ketones in the urine. A history of early onset diabetes is noted, suggesting Type 1 diabetes mellitus.",
    "actual_diagnosis": "Type 1 diabetes mellitus, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 130-year-old female presents with complaints of persistent headaches and dizziness over the past month. On physical examination, her blood pressure is recorded at 180/95 mmHg, and she exhibits mild edema in the lower extremities. Laboratory tests show elevated serum creatinine levels at 1.5 mg/dL, indicating possible renal impairment associated with chronic hypertension.",
    "actual_diagnosis": "Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 102-year-old female presents with severe pain and stiffness in her knees, particularly after prolonged sitting. On physical examination, there is noticeable crepitus and tenderness over the medial joint lines of both knees, with a reduced range of motion. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "Osteoarthritis, ICD-10 code M15.9"
  },
  {
    "doctor_vignette": "A 35-year-old male presents with severe abdominal pain radiating to the back, accompanied by nausea and vomiting. On physical examination, he exhibits tenderness in the upper abdomen and a positive Cullen's sign. Laboratory tests reveal elevated serum amylase and lipase levels, and an abdominal ultrasound shows peritoneal fluid around the pancreas.",
    "actual_diagnosis": "Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 69-year-old female presents with worsening shortness of breath and wheezing, particularly at night. On examination, she demonstrates decreased breath sounds bilaterally and prolonged expiration with audible wheezing. A peak flow measurement reveals a reading significantly below her personal best, and a chest X-ray shows no acute abnormalities. Her history includes frequent respiratory infections and a recent increase in use of her rescue inhaler.",
    "actual_diagnosis": "Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 132-year-old female presents with a chief complaint of persistent itchy rash on her arms and legs. Physical examination reveals red, inflamed patches with oozing and crusting, particularly in the antecubital and popliteal fossae. There are no significant laboratory findings, but a skin scrape shows no evidence of fungal infection. The patient has a history of dry skin and has recently changed her soap, which may have triggered her symptoms.",
    "actual_diagnosis": "Eczema, ICD-10 code L30.9"
  },
  {
    "doctor_vignette": "A 6-year-old female presents with recurrent abdominal pain and bloody diarrhea for the past three weeks. On physical examination, she has tenderness in the left lower quadrant and signs of dehydration. Laboratory tests reveal a significantly elevated C-reactive protein and anemia with low hemoglobin levels. Colonoscopy shows superficial ulcers in the colon, consistent with ulcerative colitis.",
    "actual_diagnosis": "Ulcerative colitis, ICD-10 code K51.9"
  },
  {
    "doctor_vignette": "An 18-year-old male presents with a 2-day history of fever, severe headache, and neck stiffness. On examination, he exhibits photophobia and a positive Brudzinski's sign. Lumbar puncture reveals cloudy cerebrospinal fluid with an elevated white blood cell count, predominantly neutrophils, and positive Gram stain for Streptococcus pneumoniae. Blood cultures confirm the presence of the same organism.",
    "actual_diagnosis": "Bacterial meningitis, ICD-10 code G00.9"
  },
  {
    "doctor_vignette": "A 105-year-old male presents with swelling and pain in his left leg, which has progressively worsened over the past week. Physical examination reveals significant edema and tenderness in the left calf, with a positive Homan's sign. Ultrasound imaging confirms the presence of a thrombus in the left popliteal vein. Laboratory tests show elevated D-dimer levels, indicating a possible thrombotic event.",
    "actual_diagnosis": "Deep vein thrombosis, ICD-10 code I82.90"
  },
  {
    "doctor_vignette": "A 96-year-old female presents with severe left lower abdominal pain and light vaginal bleeding. Physical examination reveals tenderness and guarding in the left lower quadrant, with a palpable mass. Transvaginal ultrasound shows an empty uterine cavity and an adnexal mass consistent with an ectopic pregnancy. Serum beta-hCG levels are significantly elevated at 2500 mIU/ml.",
    "actual_diagnosis": "Ectopic pregnancy, ICD-10 code O00.9"
  },
  {
    "doctor_vignette": "A 66-year-old male presents with persistent auditory hallucinations and disorganized speech, stating that he hears voices telling him to harm himself. Physical examination reveals poor hygiene and flattened affect. No significant abnormalities are noted on laboratory tests, and a CT scan of the brain shows no structural lesions.",
    "actual_diagnosis": "Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 148-year-old male presents with a chief complaint of worsening abdominal pain and a noticeable bulge in the left groin area. Physical examination reveals tenderness and a reducible mass upon palpation, with no signs of incarceration. An abdominal ultrasound shows a left inguinal hernia with no evidence of strangulation.",
    "actual_diagnosis": "Hernia, abdominal, ICD-10 code K44.9"
  },
  {
    "doctor_vignette": "A 64-year-old female presents with complaints of skin thickening and tightening, particularly on her hands and face, accompanied by Raynaud's phenomenon. Physical examination reveals sclerodactyly, with loss of digital creases and shiny skin on the fingers. Laboratory tests show positive anti-Scl-70 antibodies and elevated erythrocyte sedimentation rate (ESR).",
    "actual_diagnosis": "Scleroderma, ICD-10 code M34.9"
  },
  {
    "doctor_vignette": "A 54-year-old male presents with a chief complaint of a noticeable lump in his neck that has increased in size over the past three months. Physical examination reveals a firm, non-tender nodule in the right lobe of the thyroid, along with mild cervical lymphadenopathy. A thyroid ultrasound shows a hypoechoic lesion with irregular margins, and fine-needle aspiration biopsy confirms the presence of malignant cells.",
    "actual_diagnosis": "Thyroid cancer, ICD-10 code C73"
  },
  {
    "doctor_vignette": "A 150-year-old female presents with a chief complaint of recurrent headaches occurring at least 15 days a month for the past six months. On physical examination, she exhibits tenderness in the pericranial muscles and photophobia. Neurological assessment reveals no focal deficits, and a CT scan of the head is unremarkable, ruling out secondary causes of headache.",
    "actual_diagnosis": "Chronic migraine, ICD-10 code G43.709"
  },
  {
    "doctor_vignette": "A 69-year-old female presents with worsening shortness of breath on exertion and fatigue over the past few months. Physical examination reveals elevated jugular venous pressure, a loud P2 heart sound, and peripheral edema. A right heart catheterization shows a mean pulmonary artery pressure of 40 mmHg, confirming the diagnosis.",
    "actual_diagnosis": "Pulmonary hypertension, ICD-10 code I27.0"
  },
  {
    "doctor_vignette": "A 109-year-old male presents with a chief complaint of persistent ringing in his ears for the past month, which has been interfering with his sleep. On physical examination, there is slight cerumen impaction noted in both ears, but no signs of infection. Audiometry reveals a significant sensorineural hearing loss bilaterally, consistent with age-related changes. No acute abnormalities were found on CT imaging of the temporal bones.",
    "actual_diagnosis": "Tinnitus, ICD-10 code H93.11"
  },
  {
    "doctor_vignette": "A 51-year-old female presents to the emergency department with a chief complaint of experiencing recurrent seizures over the past month. Physical examination reveals postictal confusion and a slight tongue laceration. An EEG shows generalized spike-and-wave discharges consistent with epilepsy, while a CT scan of the head is unremarkable.",
    "actual_diagnosis": "Epilepsy, ICD-10 code G40.909"
  },
  {
    "doctor_vignette": "A 116-year-old male presents with persistent abdominal pain and diarrhea for the past three weeks. Physical examination reveals tenderness in the lower abdomen and signs of malnutrition. Laboratory tests show elevated inflammatory markers and a colonoscopy indicates segmental inflammation consistent with Crohn's disease.",
    "actual_diagnosis": "Crohn's disease, ICD-10 code K50.90"
  },
  {
    "doctor_vignette": "A 129-year-old female presents with fatigue and shortness of breath on exertion. Physical examination reveals pale conjunctiva and a heart rate of 110 bpm. Laboratory tests show a hemoglobin level of 8.5 g/dL, low serum ferritin, and low transferrin saturation, indicating iron deficiency.",
    "actual_diagnosis": "Iron deficiency anemia, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "An 86-year-old female presents with a chief complaint of unusual vaginal discharge and a fishy odor for the past week. Physical examination reveals a thin, grayish-white discharge and mild vulvar irritation. A wet mount shows a decrease in lactobacilli and an increase in clue cells. The pH of the vaginal discharge is measured at 5.5, confirming the diagnosis.",
    "actual_diagnosis": "Bacterial vaginosis, ICD-10 code N76.0"
  },
  {
    "doctor_vignette": "A 7-year-old male presents with complaints of persistent fatigue and difficulty breathing during play. On physical examination, he exhibits tachycardia, bilateral pitting edema, and a heart murmur. Chest X-ray reveals cardiomegaly, and an echocardiogram shows left ventricular dysfunction. Laboratory tests indicate elevated B-type natriuretic peptide (BNP) levels, confirming heart failure.",
    "actual_diagnosis": "Heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 121-year-old male presents with fatigue and palpitations. Physical exam reveals an irregular heart rhythm and mild splenomegaly. Laboratory tests show elevated cardiac enzymes and serology positive for Trypanosoma cruzi. Chest X-ray indicates cardiomegaly.",
    "actual_diagnosis": "Chagas disease, ICD-10 code B57.0"
  },
  {
    "doctor_vignette": "A 91-year-old female presents with complaints of eye strain and fatigue after reading for short periods. On examination, she demonstrates reduced visual acuity of 20/40 in both eyes, with no significant findings on a dilated fundoscopic exam. The patient reports difficulty focusing on close objects and experiences headaches in the brow region. Refraction testing reveals a need for updated prescription glasses, indicating presbyopia as a contributing factor.",
    "actual_diagnosis": "Asthenopia, ICD-10 code H53.1"
  },
  {
    "doctor_vignette": "An 82-year-old female presents with a chief complaint of severe agitation and confusion. On examination, she is febrile with a temperature of 104°F, tachycardic with a heart rate of 140 bpm, and exhibits tremors in her hands. Laboratory results reveal elevated free T4 levels at 4.5 ng/dL and a suppressed TSH level of <0.01 µIU/mL, consistent with thyrotoxicosis.",
    "actual_diagnosis": "Thyroid storm, ICD-10 code E05.01"
  },
  {
    "doctor_vignette": "A 124-year-old male presents with recurrent episodes of vertigo lasting up to an hour, accompanied by tinnitus and fluctuating hearing loss. On examination, he exhibits positive Romberg sign and nystagmus. Audiometry reveals a sensorineural hearing loss pattern. MRI of the brain shows no structural abnormalities, ruling out other causes of his symptoms.",
    "actual_diagnosis": "Meniere's disease, ICD-10 code H81.0"
  },
  {
    "doctor_vignette": "A 113-year-old female presents with acute abdominal pain localized to the right lower quadrant, accompanied by nausea and vomiting for the past 12 hours. Physical examination reveals tenderness and guarding in the right lower abdomen, with a fever of 101°F. Laboratory tests show elevated white blood cell count at 15,000/mm³, and an abdominal ultrasound reveals an enlarged, non-compressible appendix consistent with acute appendicitis.",
    "actual_diagnosis": "1. Acute appendicitis, ICD-10 code K35.2"
  },
  {
    "doctor_vignette": "A 114-year-old male presented with sudden onset shortness of breath and chest pain. Physical exam revealed tachycardia, hypoxia, and unilateral leg swelling. A CT pulmonary angiogram showed an occlusion in the right pulmonary artery. D-dimer levels were significantly elevated.",
    "actual_diagnosis": "2. Pulmonary embolism, ICD-10 code I26.9"
  },
  {
    "doctor_vignette": "An 18-year-old female presents for a routine check-up and reports occasional headaches and dizziness. Her blood pressure is measured at 150/95 mmHg, and she has a BMI in the overweight range. A urinalysis shows no abnormalities, and laboratory tests reveal normal renal function and electrolyte levels.",
    "actual_diagnosis": "5. Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with a chief complaint of intermittent numbness and tingling in her right arm and leg over the past month. Neurological examination reveals weakness in the right upper and lower extremities, along with a positive Babinski sign. MRI of the brain shows multiple hyperintense lesions in the periventricular white matter consistent with demyelination.",
    "actual_diagnosis": "3. Multiple sclerosis, ICD-10 code G35"
  },
  {
    "doctor_vignette": "A 6-year-old female presents with a chief complaint of persistent cough and wheezing, worsening with physical activity. On physical examination, she exhibits prolonged expiratory phase, decreased breath sounds bilaterally, and uses accessory muscles for breathing. A chest X-ray shows hyperinflation of the lungs, and spirometry reveals an obstructive pattern with a reduced FEV1/FVC ratio, consistent with chronic airway obstruction.",
    "actual_diagnosis": "4. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "An 87-year-old female presents with increased thirst and frequent urination over the past month. Physical examination reveals a BMI of 32, dry mucous membranes, and decreased sensation in her feet. Laboratory tests show HbA1c of 8.5% and fasting glucose level of 180 mg/dL, indicating poorly controlled blood sugar levels.",
    "actual_diagnosis": "6. Type 2 diabetes mellitus, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 103-year-old male presents with worsening shortness of breath and wheezing over the past week. Physical examination reveals prolonged expiratory phase and bilateral wheezing on auscultation. A peak flow measurement shows a reading significantly below his baseline, and a chest X-ray shows hyperinflation of the lungs but no acute infiltrates.",
    "actual_diagnosis": "10. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "An 80-year-old female presents with persistent cough and recurrent respiratory infections. Physical examination reveals digital clubbing and wheezing on auscultation. Chest X-ray shows bronchiectasis, and sputum culture grows Pseudomonas aeruginosa. Sweat chloride test returns elevated levels, confirming a diagnosis consistent with cystic fibrosis.",
    "actual_diagnosis": "8. Cystic fibrosis, ICD-10 code E84.9"
  },
  {
    "doctor_vignette": "A 61-year-old female presents with persistent shortness of breath and swelling in her legs. On physical exam, she has elevated jugular venous pressure, bilateral pedal edema, and crackles on lung auscultation. An echocardiogram reveals a reduced ejection fraction of 35%, and a BNP level is significantly elevated at 800 pg/mL.",
    "actual_diagnosis": "11. Congestive heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "An 8-year-old female presents with complaints of fatigue and weight gain despite a normal appetite. Physical examination reveals dry skin, thinning hair, and bradycardia. Laboratory tests show elevated TSH levels and low free T4, indicating hypothyroidism.",
    "actual_diagnosis": "12. Hypothyroidism, ICD-10 code E03.9"
  },
  {
    "doctor_vignette": "A 9-year-old male presents with abdominal pain and diarrhea lasting for two weeks. On examination, he has tenderness in the right lower quadrant and appears to have lost weight. Laboratory tests reveal anemia with low hemoglobin levels and elevated inflammatory markers. An abdominal ultrasound shows thickening of the ileal wall, suggesting possible Crohn's disease.",
    "actual_diagnosis": "7. Crohn's disease, ICD-10 code K50.90"
  },
  {
    "doctor_vignette": "A 96-year-old male presents with increasing social withdrawal and auditory hallucinations, stating he hears voices that tell him to harm himself. Physical examination reveals a flat affect and disorganized thinking, with no acute medical issues noted. MRI of the brain shows age-related changes but no acute intracranial abnormalities, and routine lab tests are within normal limits. These findings are consistent with a diagnosis of schizophrenia.",
    "actual_diagnosis": "13. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 149-year-old male presents with severe pain and swelling in his right big toe, which began suddenly two days ago. On examination, the affected joint is erythematous and tender to touch, with limited range of motion. Serum uric acid levels are significantly elevated at 9.5 mg/dL, and a joint aspiration reveals needle-shaped monosodium urate crystals. ",
    "actual_diagnosis": "14. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with persistent knee pain, particularly during weight-bearing activities. On physical examination, there is tenderness and swelling around the medial aspect of the right knee, with reduced range of motion and crepitus noted during flexion and extension. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "9. Osteoarthritis, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "An 18-year-old female presents with joint pain and fatigue for the past month. On physical exam, she has a facial rash resembling a butterfly distribution across her cheeks, and her joints exhibit swelling and tenderness. Laboratory tests reveal a positive antinuclear antibody (ANA) test and elevated anti-double-stranded DNA antibodies, consistent with autoimmune activity.",
    "actual_diagnosis": "15. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 19-year-old male presents to the emergency department with palpitations and shortness of breath that began suddenly while playing basketball. Physical examination reveals an irregularly irregular pulse at a rate of 150 beats per minute and mild bilateral edema in the lower extremities. An ECG shows atrial fibrillation with rapid ventricular response, and a chest X-ray is unremarkable.",
    "actual_diagnosis": "18. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "An 11-year-old male presents with recurrent fevers and lymphadenopathy over the past month. On physical examination, notable cervical lymphadenopathy and splenomegaly are observed. Laboratory tests reveal elevated inflammatory markers and positive cultures for non-tuberculous mycobacteria. Genetic testing confirms a mutation associated with Mendelian susceptibility to mycobacterial disease.",
    "actual_diagnosis": "16. Mendelian susceptibility to mycobacterial disease, ICD-10 code D84.81"
  },
  {
    "doctor_vignette": "A 20-year-old female presents with severe abdominal pain radiating to her back, accompanied by nausea and vomiting for the past 24 hours. On physical examination, she exhibits tenderness in the epigastric region and signs of guarding. Laboratory tests reveal elevated serum amylase and lipase levels, and an abdominal ultrasound shows peritoneal fluid but no gallstones.",
    "actual_diagnosis": "19. Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 69-year-old male presents with chronic blistering and erosions on the skin, predominantly on the hands and forearms, which have worsened over the past year. Physical examination reveals fragile, blistered skin with scarring and thickening in areas of trauma. A skin biopsy shows a separation of the epidermis from the dermis, confirming the diagnosis. Genetic testing reveals mutations in the COL7A1 gene, consistent with dystrophic epidermolysis bullosa.",
    "actual_diagnosis": "20. Epidermolysis bullosa, ICD-10 code Q81.9"
  },
  {
    "doctor_vignette": "A 56-year-old male presents with a chief complaint of unintentional weight loss and increased anxiety over the past three months. On physical examination, he exhibits tachycardia, tremors in his hands, and a noticeable goiter. Laboratory results reveal elevated free T4 and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "An 84-year-old male presents with persistent fatigue and unexplained weight loss over the past three months. Physical examination reveals cervical lymphadenopathy and splenomegaly. A CT scan shows enlarged mediastinal lymph nodes, and a biopsy confirms Reed-Sternberg cells. Blood tests indicate elevated lactate dehydrogenase (LDH) levels.",
    "actual_diagnosis": "Hodgkin lymphoma, ICD-10 code C81.90"
  },
  {
    "doctor_vignette": "A 102-year-old male presents with increasing memory loss and confusion over the past 6 months. Physical examination reveals disorientation to time and place, and he is unable to recall recent events. Neurological assessment shows mild aphasia and impaired short-term memory. MRI of the brain indicates general cerebral atrophy, consistent with dementia.",
    "actual_diagnosis": "Dementia, ICD-10 code F03.90"
  },
  {
    "doctor_vignette": "A 143-year-old male presents with excessive daytime sleepiness and sudden episodes of muscle weakness triggered by laughter. Physical examination reveals normal neurological function with no signs of other sleep disorders. Polysomnography shows reduced REM latency and multiple sleep-onset REM periods, confirming the diagnosis.",
    "actual_diagnosis": "Narcolepsy, ICD-10 code G47.419"
  },
  {
    "doctor_vignette": "A 133-year-old male presents with fatigue and muscle weakness. Physical examination reveals xanthomas on the elbows and knees, indicative of lipid accumulation. Laboratory results show elevated total cholesterol of 320 mg/dL and triglycerides of 250 mg/dL. These findings are consistent with significant dyslipidemia.",
    "actual_diagnosis": "17. Hyperlipidemia, ICD-10 code E78.5"
  },
  {
    "doctor_vignette": "A 44-year-old female presents with a chief complaint of high fever and severe joint pain for the past three days. On examination, she has a temperature of 102°F, notable swelling in her hands and wrists, and a rash on her trunk. Laboratory tests reveal elevated liver enzymes and a positive serology for Chikungunya virus.",
    "actual_diagnosis": "Chikungunya fever, ICD-10 code A92.0"
  },
  {
    "doctor_vignette": "A 141-year-old male presents with fatigue and recurrent infections over the past month. Physical examination reveals pallor, splenomegaly, and petechiae on the lower extremities. Complete blood count shows leukocytosis with 80% lymphoblasts and thrombocytopenia. Bone marrow biopsy confirms the diagnosis of acute lymphoblastic leukemia.",
    "actual_diagnosis": "Acute lymphoblastic leukemia, ICD-10 code C91.0"
  },
  {
    "doctor_vignette": "A 101-year-old male presents with persistent fatigue and unexplained bruising. On examination, he exhibits pallor and splenomegaly. Laboratory results reveal leukocytosis with a predominance of blast cells and thrombocytopenia. A bone marrow biopsy confirms the presence of acute leukemia.",
    "actual_diagnosis": "Leukemia, ICD-10 code C91.90"
  },
  {
    "doctor_vignette": "A 43-year-old male presents to the emergency department with sudden onset of severe chest and back pain, described as tearing in nature. On physical examination, he has a pronounced pulse in the abdomen and a blood pressure of 80/50 mmHg. A chest X-ray shows a widened mediastinum, and a CT scan confirms the presence of an aortic aneurysm measuring 5.5 cm in diameter.",
    "actual_diagnosis": "Aortic aneurysm, ICD-10 code I71.9"
  },
  {
    "doctor_vignette": "A 131-year-old female presents with a chief complaint of increasing difficulty with movement and tremors in her right hand. On physical examination, she exhibits bradykinesia, a resting tremor, and rigidity in the limbs. A recent MRI shows mild cortical atrophy without acute intracranial abnormalities. Lab tests reveal normal levels of thyroid function and no signs of metabolic disorders.",
    "actual_diagnosis": "Parkinson’s disease, ICD-10 code G20"
  },
  {
    "doctor_vignette": "A 124-year-old female presents with progressive cognitive decline and tremors. On physical examination, she exhibits a mask-like facial expression and Kayser-Fleischer rings in her corneas. Laboratory tests reveal elevated serum copper levels and low ceruloplasmin. MRI of the brain shows basal ganglia hyperintensities consistent with Wilson's disease.",
    "actual_diagnosis": "Wilson's disease, ICD-10 code E83.0"
  },
  {
    "doctor_vignette": "A 122-year-old male presents with a chief complaint of worsening shortness of breath and cough for the past three days. Physical examination reveals decreased breath sounds and dullness to percussion in the right lower lung field. Chest X-ray shows right lower lobe consolidation, and sputum culture is positive for Streptococcus pneumoniae.",
    "actual_diagnosis": "Pneumonia due to Streptococcus pneumoniae, ICD-10 code J18.0"
  },
  {
    "doctor_vignette": "A 148-year-old male presents with a chief complaint of persistent facial acne and lesions for the past six months. On physical examination, there are multiple comedones, papules, and pustules primarily on the face, particularly on the forehead and cheeks. No systemic abnormalities are noted, and laboratory tests reveal normal hormone levels, ruling out secondary causes of acne.",
    "actual_diagnosis": "Acne vulgaris, ICD-10 code L70.0"
  },
  {
    "doctor_vignette": "A 22-year-old female presents with persistent fatigue and unexplained weight loss over the past month. On physical exam, notable findings include lymphadenopathy in the cervical and axillary regions. Laboratory tests reveal elevated lactate dehydrogenase (LDH) levels and a biopsy of the enlarged lymph nodes shows atypical lymphoid cells. CT imaging of the chest and abdomen shows multiple enlarged lymph nodes, consistent with lymphoma.",
    "actual_diagnosis": "Non-Hodgkin lymphoma, ICD-10 code C85.90"
  },
  {
    "doctor_vignette": "A 144-year-old female presents with severe left lower quadrant abdominal pain and fever. On physical examination, she exhibits tenderness and guarding in the left lower abdomen. A CT scan of the abdomen reveals multiple diverticula with associated inflammation and thickening of the colonic wall. Laboratory tests show an elevated white blood cell count indicating infection.",
    "actual_diagnosis": "Diverticulitis, ICD-10 code K57.92"
  },
  {
    "doctor_vignette": "A 60-year-old female presents with progressive muscle weakness, particularly in her lower extremities, leading to difficulty walking. Physical examination reveals significant muscle atrophy in the proximal muscles and diminished deep tendon reflexes. Electromyography shows signs of neurogenic changes, and genetic testing confirms a deletion in the SMN1 gene.",
    "actual_diagnosis": "Spinal muscular atrophy, ICD-10 code G12.0"
  },
  {
    "doctor_vignette": "A 13-year-old male presents with increased thirst, frequent urination, and fatigue for the past month. Physical exam reveals obesity with a BMI in the 95th percentile, and acanthosis nigricans on his neck. Laboratory tests show an elevated fasting blood glucose level of 180 mg/dL and HbA1c of 7.2%.",
    "actual_diagnosis": "Diabetes mellitus type 2, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 131-year-old male presented with a chief complaint of fever and increased shortness of breath for three days. Physical examination revealed decreased breath sounds and crackles upon auscultation, along with a temperature of 102°F. A chest X-ray showed bilateral infiltrates, and sputum culture confirmed the presence of Streptococcus pneumoniae.",
    "actual_diagnosis": "Bacterial pneumonia, ICD-10 code J18.9"
  },
  {
    "doctor_vignette": "A 23-year-old female presents with a chief complaint of severe fatigue and petechial rash on her lower extremities. Physical examination reveals pallor and mucosal bleeding. Laboratory tests show a markedly low platelet count of 20,000/µL, elevated lactate dehydrogenase (LDH) levels, and a negative direct Coombs test, suggesting microangiopathic hemolytic anemia.",
    "actual_diagnosis": "Thrombotic thrombocytopenic purpura, ICD-10 code D68.4"
  },
  {
    "doctor_vignette": "An 113-year-old male presents with a chief complaint of persistent joint pain and stiffness, particularly in the hands and knees. Physical examination reveals swollen, tender metacarpophalangeal joints and a decreased range of motion in the affected areas. Laboratory tests show elevated rheumatoid factor and anti-CCP antibodies, along with anemia and elevated ESR.",
    "actual_diagnosis": "Rheumatoid arthritis, ICD-10 code M05.9"
  },
  {
    "doctor_vignette": "A 116-year-old male presents with a chief complaint of unintentional weight loss and increased appetite over the past month. Physical examination reveals tremors in the hands, a rapid heartbeat at 110 beats per minute, and warm, moist skin. Thyroid function tests show elevated free T4 and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "Hyperthyroidism, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 127-year-old male presents with recurrent, severe facial pain described as electric shocks on the right side of his face, lasting seconds to minutes. Physical examination reveals tenderness along the right maxillary and mandibular branches of the trigeminal nerve, with no neurological deficits. MRI of the brain shows vascular compression of the trigeminal nerve root entry zone.",
    "actual_diagnosis": "Trigeminal neuralgia, ICD-10 code G50.0"
  },
  {
    "doctor_vignette": "A 148-year-old female presents with recurrent episodes of intense fear, accompanied by palpitations, shortness of breath, and dizziness. Physical examination reveals mild tachycardia and normal respiratory effort, with no signs of acute distress. Laboratory tests, including a complete blood count and metabolic panel, are unremarkable, ruling out other causes of her symptoms.",
    "actual_diagnosis": "Panic disorder, ICD-10 code F41.0"
  },
  {
    "doctor_vignette": "A 102-year-old female presents to the emergency department with severe right upper quadrant abdominal pain and fever. On physical examination, she exhibits tenderness and guarding in the right upper quadrant, with a positive Murphy's sign. Laboratory tests reveal leukocytosis with a white blood cell count of 15,000/mm³, and an abdominal ultrasound shows a thickened gallbladder wall with pericholecystic fluid, indicative of acute cholecystitis.",
    "actual_diagnosis": "Acute cholecystitis, ICD-10 code K81.0"
  },
  {
    "doctor_vignette": "A 21-year-old female presents with excessive daytime sleepiness and episodes of sudden muscle weakness triggered by laughter. Physical examination reveals a normal neurological assessment, with no signs of other sleep disorders. A polysomnography shows decreased REM latency and multiple sleep-onset REM periods, confirming her symptoms.",
    "actual_diagnosis": "Narcolepsy, ICD-10 code G47.4"
  },
  {
    "doctor_vignette": "An 8-year-old female presents with a chief complaint of high fever and lethargy for two days. On examination, she is febrile at 39.5°C, tachycardic, and exhibits signs of dehydration with dry mucous membranes. Laboratory tests reveal leukocytosis with a white blood cell count of 18,000/mm³ and elevated lactate levels of 4.5 mmol/L, indicating possible septic shock.",
    "actual_diagnosis": "Sepsis, ICD-10 code A41.9"
  },
  {
    "doctor_vignette": "A 77-year-old female presents with chronic lower back pain and stiffness, particularly in the morning. Physical examination reveals restricted lumbar spine mobility and tenderness over the sacroiliac joints. Imaging shows bilateral sacroiliitis on X-ray. Laboratory tests indicate elevated inflammatory markers, including ESR and CRP.",
    "actual_diagnosis": "Ankylosing spondylitis, ICD-10 code M45.9"
  },
  {
    "doctor_vignette": "A 20-year-old female presents with recurrent episodes of severe headaches, palpitations, and sweating. On physical examination, her blood pressure is noted to be 180/110 mmHg, and she has a heart rate of 120 beats per minute. Urine tests reveal elevated levels of catecholamines and metanephrines, while an abdominal CT scan shows a 3 cm adrenal mass consistent with a pheochromocytoma.",
    "actual_diagnosis": "Pheochromocytoma, ICD-10 code C74.1"
  },
  {
    "doctor_vignette": "An 18-year-old female presents with severe pain in her chest and back, rated 8/10. On physical exam, she exhibits pallor and tenderness in her abdomen, with decreased breath sounds bilaterally. Laboratory tests reveal a hemoglobin level of 6.5 g/dL and a peripheral blood smear shows sickle-shaped red blood cells.",
    "actual_diagnosis": "Sickle cell disease, ICD-10 code D57.0"
  },
  {
    "doctor_vignette": "An 85-year-old male presents with social withdrawal and difficulty in understanding social cues. On physical exam, he demonstrates rigid body posture and limited eye contact, consistent with his lifelong pattern of behavior. He reports a keen interest in specific topics but struggles with initiating conversations. No critical lab or imaging results are applicable as this is a developmental disorder diagnosis.",
    "actual_diagnosis": "Asperger syndrome, ICD-10 code F84.5"
  },
  {
    "doctor_vignette": "A 10-year-old female presents with complaints of frequent headaches and difficulty with vision. On physical examination, she is noted to have long fingers and toes (arachnodactyly), a tall stature, and a scoliosis deformity. An echocardiogram reveals dilation of the aortic root, consistent with connective tissue disorder.",
    "actual_diagnosis": "Marfan syndrome, ICD-10 code Q87.4"
  },
  {
    "doctor_vignette": "A 104-year-old male presented to the clinic with increased thirst and frequent urination over the past month. Physical examination revealed a BMI of 28, and he was noted to have dry mucous membranes and decreased skin turgor. Laboratory tests indicated a fasting blood glucose level of 210 mg/dL and HbA1c of 8.2%.",
    "actual_diagnosis": "Type 2 diabetes mellitus, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 104-year-old female presents with persistent knee pain, exacerbated by movement and relieved by rest. On physical examination, there is notable crepitus and tenderness over the bilateral knees, with decreased range of motion. X-rays reveal joint space narrowing and osteophyte formation, consistent with degenerative changes. No inflammatory markers are elevated in her lab results.",
    "actual_diagnosis": "Osteoarthritis, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 134-year-old female presents with a complaint of a palpable swelling in her neck that has gradually increased over the past few months. On physical examination, a firm, non-tender nodule is noted on the right lobe of the thyroid, measuring approximately 2 cm. Ultrasound reveals a solid, hypoechoic nodule with microcalcifications. Thyroid function tests show normal TSH and free T4 levels.",
    "actual_diagnosis": "Thyroid nodule, ICD-10 code E04.1"
  },
  {
    "doctor_vignette": "A 94-year-old female presents to the emergency department with chest pain radiating to her left arm and shortness of breath. On examination, she is diaphoretic, with a heart rate of 110 bpm and blood pressure of 90/60 mmHg. ECG shows ST-segment elevation in leads II, III, and aVF, and troponin levels are markedly elevated. Her medical history includes hypertension and hyperlipidemia.",
    "actual_diagnosis": "Myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 27-year-old female presents with unilateral swelling and pain in her left leg, which has been worsening over the past three days. Physical examination reveals significant edema, tenderness along the left calf, and a positive Homan's sign. Doppler ultrasound of the left leg shows a thrombus in the popliteal vein, confirming the diagnosis.",
    "actual_diagnosis": "Deep vein thrombosis, ICD-10 code I82.409"
  },
  {
    "doctor_vignette": "A 64-year-old male presents with muscle cramps and tingling sensations in his fingers. On physical exam, he demonstrates Chvostek's sign and Trousseau's sign, indicating neuromuscular excitability. Laboratory results reveal a low serum calcium level of 7.5 mg/dL and an elevated serum phosphate level of 5.5 mg/dL, consistent with hypoparathyroidism.",
    "actual_diagnosis": "Hypoparathyroidism, ICD-10 code E20.9"
  },
  {
    "doctor_vignette": "A 127-year-old male presents with gradual loss of peripheral vision and intermittent headaches. On examination, his intraocular pressure is found to be elevated at 28 mmHg, with a notable cupping of the optic disc. Visual field testing reveals significant loss in the peripheral fields, consistent with glaucomatous changes. No other ocular abnormalities were noted during the slit-lamp examination.",
    "actual_diagnosis": "Glaucoma, ICD-10 code H40.9"
  },
  {
    "doctor_vignette": "A 74-year-old female presents with a chief complaint of persistent heartburn and regurgitation occurring several times a week. On physical examination, she exhibits mild epigastric tenderness and no signs of abdominal distension. An upper gastrointestinal endoscopy reveals esophagitis consistent with gastroesophageal reflux disease. A pH monitoring study confirms abnormal acid exposure in the esophagus.",
    "actual_diagnosis": "Acid reflux disease (GERD), ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "A 44-year-old male presents with progressive weakness and atrophy of the distal muscles in both legs, making it difficult for him to walk. On examination, there is notable foot drop and a high-arched foot deformity, along with decreased sensation in the lower extremities. Nerve conduction studies reveal slowed conduction velocities in the peroneal and tibial nerves, consistent with a hereditary neuropathy.",
    "actual_diagnosis": "Charcot-Marie-Tooth disease, ICD-10 code G60.9"
  },
  {
    "doctor_vignette": "A 16-year-old female presents with increased thirst, frequent urination, and unintentional weight loss over the past month. On physical exam, she is noted to have dry mucous membranes and abdominal tenderness. A random blood glucose level is measured at 350 mg/dL, and ketones are detected in her urine.",
    "actual_diagnosis": "Diabetes mellitus type 1, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 36-year-old male presents with infertility and decreased libido. Physical examination reveals tall stature, gynecomastia, and reduced testicular volume. Laboratory tests show low testosterone levels and elevated luteinizing hormone (LH) and follicle-stimulating hormone (FSH), suggestive of primary testicular failure.",
    "actual_diagnosis": "Klinefelter syndrome, ICD-10 code Q98.1"
  },
  {
    "doctor_vignette": "A 96-year-old female presents with sudden onset of right-sided weakness and difficulty speaking. On physical examination, she exhibits right-sided hemiparesis and expressive aphasia. A CT scan of the head shows an area of hypodensity in the left hemisphere, suggesting an ischemic stroke. Laboratory results reveal elevated D-dimer levels, indicating a possible thromboembolic event.",
    "actual_diagnosis": "Acute ischemic stroke, ICD-10 code I63.9"
  },
  {
    "doctor_vignette": "A 126-year-old male presents to the emergency department with chief complaints of difficulty breathing, swelling of the lips, and hives after eating shrimp for the first time. Physical exam reveals pronounced respiratory distress, wheezing, and diffuse urticaria. Vital signs show hypotension with a blood pressure of 70/40 mmHg and a heart rate of 120 bpm. Laboratory results indicate elevated tryptase levels and low oxygen saturation at 85%.",
    "actual_diagnosis": "Anaphylactic shock, ICD-10 code T78.2"
  },
  {
    "doctor_vignette": "A 75-year-old male presents with progressive blurred vision and increased sensitivity to light over the past year. On examination, there is notable corneal thinning and a conical protrusion of the cornea, along with irregular astigmatism. Topography imaging reveals a steepening of the inferior cornea, consistent with keratoconus.",
    "actual_diagnosis": "Keratoconus, ICD-10 code H18.603"
  },
  {
    "doctor_vignette": "An 8-year-old female presents with complaints of persistent fatigue and difficulty breathing during physical activities. On examination, she has bilateral lower extremity edema and a rapid heart rate. Chest X-ray shows cardiomegaly and pulmonary congestion. Laboratory tests reveal elevated B-type natriuretic peptide (BNP) levels, indicating heart strain.",
    "actual_diagnosis": "Congestive heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 135-year-old female presents with severe shortness of breath and a productive cough lasting for two weeks. On physical examination, she is tachypneic, with bilateral crackles and decreased breath sounds. Chest X-ray reveals bilateral infiltrates consistent with pneumonia, and her white blood cell count is elevated at 15,000 cells/mm³.",
    "actual_diagnosis": "Pneumonia, unspecified (ICD-10 code: J18.9)"
  },
  {
    "doctor_vignette": "An 87-year-old female presents with severe fatigue and intermittent joint pain in her hands and knees. On physical examination, she demonstrates pallor and has swollen, painful joints. Laboratory results reveal a hemoglobin level of 8.5 g/dL with sickled cells observed on the peripheral blood smear, confirming the diagnosis.",
    "actual_diagnosis": "Sickle cell disease, ICD-10 code D57.1"
  },
  {
    "doctor_vignette": "A 144-year-old female presents with fatigue and jaundice. On physical examination, she exhibits scleral icterus and hepatomegaly. Laboratory tests reveal elevated liver enzymes (ALT 150 U/L, AST 180 U/L) and a positive hepatitis C antibody test. Ultrasound shows mild hepatic steatosis.",
    "actual_diagnosis": "Hepatitis C, ICD-10 code B17.1"
  },
  {
    "doctor_vignette": "A 44-year-old female presents with a chief complaint of unexplained weight gain and fatigue over the past six months. On physical examination, she exhibits a rounded face, thinning skin with easy bruising, and abdominal striae. Laboratory tests reveal elevated serum cortisol levels and a 24-hour urinary free cortisol test shows increased cortisol excretion, indicating hypercortisolism.",
    "actual_diagnosis": "Cushing’s syndrome, ICD-10 code E24.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of widespread musculoskeletal pain lasting for over three months. On physical examination, she exhibits tenderness in multiple trigger points, including the neck, shoulders, and lower back, along with fatigue and sleep disturbances. Laboratory tests show normal complete blood count, metabolic panel, and inflammatory markers, ruling out other conditions.",
    "actual_diagnosis": "Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 46-year-old female presents with fatigue, pallor, and recurrent infections over the past month. Physical examination reveals marked pallor, petechiae on her extremities, and a heart rate of 110 bpm. Complete blood count shows severe anemia with hemoglobin at 7 g/dL, leukopenia with a white blood cell count of 2,000/mm³, and thrombocytopenia with a platelet count of 30,000/mm³, indicating bone marrow failure.",
    "actual_diagnosis": "Aplastic anemia, ICD-10 code D61.9"
  },
  {
    "doctor_vignette": "A 37-year-old female presents with a 5-day history of high fever, conjunctival injection, and a rash. Physical examination reveals cervical lymphadenopathy and cracked, swollen lips. Laboratory tests show elevated inflammatory markers with a markedly elevated C-reactive protein (CRP) level, and echocardiogram indicates coronary artery dilation.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I72.2"
  },
  {
    "doctor_vignette": "A 95-year-old male presents with fever, night sweats, and significant fatigue lasting for two weeks. Physical examination reveals splenomegaly and tenderness in the lower abdomen. Blood cultures are positive for Brucella species, and serology shows elevated anti-Brucella antibodies. The patient has a history of exposure to unpasteurized dairy products.",
    "actual_diagnosis": "Brucellosis, ICD-10 code A23.9"
  },
  {
    "doctor_vignette": "A 71-year-old male presents with persistent dry cough and shortness of breath over the past month. Physical examination reveals bilateral hilar lymphadenopathy and diffuse crackles on lung auscultation. Chest X-ray shows enlarged hilar lymph nodes, and serum angiotensin-converting enzyme (ACE) levels are elevated, supporting the diagnosis.",
    "actual_diagnosis": "Sarcoidosis, ICD-10 code D86.9"
  },
  {
    "doctor_vignette": "A 48-year-old male presents with fatigue, recurrent infections, and easy bruising over the past month. Physical examination reveals pallor, petechiae, and splenomegaly. Complete blood count shows leukocytosis with 60% myeloblasts and thrombocytopenia. Bone marrow biopsy confirms the presence of acute myeloid leukemia.",
    "actual_diagnosis": "Acute myeloid leukemia, ICD-10 code C92.0"
  },
  {
    "doctor_vignette": "A 94-year-old male presents with a persistent high fever lasting over five days, accompanied by a rash and conjunctivitis. Physical examination reveals cervical lymphadenopathy and cracked lips. Laboratory tests show elevated inflammatory markers and a notable thrombocytosis, while echocardiogram indicates coronary artery dilation.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I38"
  },
  {
    "doctor_vignette": "A 46-year-old female presents with a chief complaint of worsening cough and fever for three days. On examination, she exhibits decreased breath sounds and dullness to percussion in the right lower lung field. Chest X-ray reveals a right lower lobe infiltrate, and a sputum culture confirms the presence of Streptococcus pneumoniae.",
    "actual_diagnosis": "Pneumonia due to Streptococcus pneumoniae, ICD-10 code J18.9"
  },
  {
    "doctor_vignette": "A 38-year-old female presents with fatigue and persistent lower back pain. On physical examination, she has mild edema in her lower extremities and palpable tenderness in the bilateral flank areas. Laboratory tests reveal an elevated serum creatinine level of 2.1 mg/dL and a glomerular filtration rate (GFR) of 45 mL/min, indicating a decline in kidney function.",
    "actual_diagnosis": "Chronic kidney disease stage 3, ICD-10 code N18.3"
  },
  {
    "doctor_vignette": "A 23-year-old male presents to the emergency department with difficulty breathing and extensive hives after eating shellfish for the first time. On physical examination, he is noted to have angioedema of the lips and tongue, wheezing, and a blood pressure of 90/60 mmHg. Initial lab results show elevated serum tryptase levels consistent with anaphylaxis.",
    "actual_diagnosis": "Severe allergic reaction, ICD-10 code T78.2"
  },
  {
    "doctor_vignette": "A 59-year-old male presents with complaints of excessive daytime sleepiness and loud snoring, reported by his partner. On physical examination, he has a body mass index of 32, a thick neck circumference of 18 inches, and exhibits signs of fatigue. A polysomnography reveals multiple episodes of apnea and hypopnea throughout the night, confirming the diagnosis.",
    "actual_diagnosis": "Obstructive sleep apnea, ICD-10 code G47.33"
  },
  {
    "doctor_vignette": "An 85-year-old female presents with a chief complaint of persistent cough and unintentional weight loss over the past month. On physical examination, she exhibits decreased breath sounds in the right upper lung field and crackles upon auscultation. A chest X-ray reveals a cavitary lesion in the right upper lobe, and sputum analysis is positive for Mycobacterium tuberculosis.",
    "actual_diagnosis": "Tuberculosis of the lung, ICD-10 code A15.0"
  },
  {
    "doctor_vignette": "A 113-year-old male presents with a chief complaint of persistent pelvic pain and frequent urination, experiencing urgency with minimal urine output. Physical examination reveals tenderness in the suprapubic area and no abnormalities in the genitalia. Urinalysis shows no signs of infection, while cystoscopy reveals bladder wall inflammation and glomerulations, consistent with interstitial cystitis.",
    "actual_diagnosis": "Interstitial cystitis, ICD-10 code N30.10"
  },
  {
    "doctor_vignette": "An 88-year-old female presents to the emergency department with sudden onset of severe headache and right-sided weakness. On physical examination, she exhibits right-sided hemiparesis and expressive aphasia. A CT scan of the head reveals a large intracerebral hemorrhage in the left hemisphere. Laboratory tests show normal coagulation profile.",
    "actual_diagnosis": "Hemorrhagic stroke, ICD-10 code I61.9"
  },
  {
    "doctor_vignette": "A 29-year-old female presents with persistent fatigue, weight loss, and increased pigmentation of her skin. On physical examination, she has low blood pressure and hyperkalemia is noted on lab results, along with low cortisol levels. The ACTH stimulation test confirms adrenal insufficiency.",
    "actual_diagnosis": "Addison's disease, ICD-10 code E27.1"
  },
  {
    "doctor_vignette": "A 77-year-old male presents with a chief complaint of increasing discomfort due to multiple skin lesions. Physical examination reveals numerous café-au-lait spots and neurofibromas on his trunk and extremities. MRI of the brain shows no evidence of tumors, but there are indications of plexiform neurofibromas in the cervical region. Family history is notable for similar skin findings in relatives, suggesting a genetic predisposition.",
    "actual_diagnosis": "Neurofibromatosis type 1, ICD-10 code Q85.0"
  },
  {
    "doctor_vignette": "A 124-year-old male presents with increased thirst and frequent urination over the past month. Physical examination reveals obesity with a BMI of 32, and a foot exam shows slight neuropathy. Laboratory tests indicate an HbA1c of 8.5% and fasting glucose of 180 mg/dL, confirming poor glycemic control.",
    "actual_diagnosis": "4. Diabetes mellitus type 2, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 31-year-old female presents with increasing shortness of breath and a persistent cough over the past six months. On physical examination, she has wheezing and decreased breath sounds bilaterally, along with mild jaundice. A serum alpha-1 antitrypsin level is found to be significantly low, and a CT scan of the chest shows emphysematous changes in the lower lobes. ",
    "actual_diagnosis": "Alpha-1 antitrypsin deficiency, ICD-10 code E88.01"
  },
  {
    "doctor_vignette": "A 107-year-old female presents to the emergency department with acute chest pain and shortness of breath. On examination, she exhibits diaphoresis, tachycardia, and a blood pressure of 90/60 mmHg. An ECG reveals ST-segment elevation in the inferior leads, and cardiac troponin levels are significantly elevated. ",
    "actual_diagnosis": "5. Acute myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 10-year-old female presents with recurrent abdominal pain, diarrhea, and significant weight loss over the past six months. Physical examination reveals a distended abdomen and signs of malnutrition, including pallor and delayed growth. Serological tests show elevated tissue transglutaminase (tTG) antibodies and a confirmatory duodenal biopsy indicates villous atrophy.",
    "actual_diagnosis": "8. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 14-year-old male presents with a chief complaint of persistent cough and shortness of breath, particularly during physical activities. On examination, he has diminished breath sounds and wheezing bilaterally, with a prolonged expiratory phase noted. A chest X-ray reveals hyperinflated lungs, and spirometry shows a reduced FEV1/FVC ratio consistent with obstructive lung disease.",
    "actual_diagnosis": "6. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 49-year-old female presents with complaints of unintentional weight loss, increased anxiety, and palpitations over the past few months. On physical examination, she exhibits a fine tremor in her hands, a rapid heart rate of 110 bpm, and noticeable enlargement of the thyroid gland. Laboratory tests reveal elevated free T4 and suppressed TSH levels, confirming the diagnosis.",
    "actual_diagnosis": "9. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 51-year-old female presents with persistent pain and stiffness in her right knee, particularly after prolonged sitting or activity. On physical examination, there is tenderness over the medial joint line, and the knee shows decreased range of motion with crepitus noted during flexion and extension. X-rays reveal joint space narrowing and osteophyte formation, confirming the diagnosis.",
    "actual_diagnosis": "7. Osteoarthritis of knee, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 132-year-old female presents with persistent fatigue and a rash on her face that resembles a butterfly pattern across her cheeks. Physical examination reveals joint swelling in her hands and signs of pleuritis. Laboratory tests show positive anti-nuclear antibodies (ANA) and a low complement level, indicative of autoimmune activity.",
    "actual_diagnosis": "10. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 1-year-old male presents with sudden onset of severe chest and back pain, accompanied by vomiting. On examination, he has a weak pulse in the right arm compared to the left, and a blood pressure differential of 20 mmHg between the arms. A chest X-ray reveals a widened mediastinum, and a subsequent echocardiogram shows evidence of aortic dissection.",
    "actual_diagnosis": "12. Aortic dissection, ICD-10 code I71.0"
  },
  {
    "doctor_vignette": "A 40-year-old female presents with recurrent episodes of staring and unresponsiveness lasting about 1-2 minutes over the past month. Physical examination reveals no focal neurological deficits, but the patient appears confused after each episode. An EEG shows generalized spike-and-wave activity consistent with epileptic seizures, and a brain MRI is unremarkable.",
    "actual_diagnosis": "11. Epilepsy, ICD-10 code G40.909"
  },
  {
    "doctor_vignette": "An 8-year-old female presents with a chief complaint of itchy, scaly patches on her elbows and knees that have persisted for several weeks. Physical examination reveals well-defined, erythematous plaques covered with silvery scales in typical locations. There is no evidence of secondary infection, and laboratory tests show no abnormalities in inflammatory markers. Family history is significant for psoriasis in her mother.",
    "actual_diagnosis": "13. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 60-year-old female presents with a persistent productive cough and increased shortness of breath over the past few months. Physical examination reveals digital clubbing and wheezing on auscultation. Chest X-ray shows bronchiectasis, and sputum culture is positive for Pseudomonas aeruginosa, indicating chronic lung infection.",
    "actual_diagnosis": "14. Cystic fibrosis, ICD-10 code E84.9"
  },
  {
    "doctor_vignette": "A 2-year-old male presents with intermittent episodes of weakness, particularly in the arms and legs, which worsen with activity and improve with rest. On examination, he exhibits noticeable ptosis and generalized muscle fatigue, especially after prolonged play. A repetitive nerve stimulation test shows a decremental response, and serum anti-acetylcholine receptor antibodies are elevated. These findings are suggestive of myasthenia gravis in this young patient.",
    "actual_diagnosis": "15. Myasthenia gravis, ICD-10 code G70.00"
  },
  {
    "doctor_vignette": "An 111-year-old male presents with progressive muscle weakness and difficulty swallowing over the past six months. Physical examination reveals fasciculations in the tongue and atrophy of the upper extremities. Neurological assessment shows brisk deep tendon reflexes and a positive Babinski sign. Electromyography confirms widespread denervation and reinnervation patterns consistent with amyotrophic lateral sclerosis.",
    "actual_diagnosis": "18. Amyotrophic lateral sclerosis, ICD-10 code G12.21"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with progressive weakness in his lower extremities over the past week, accompanied by tingling and numbness. On examination, he exhibits decreased deep tendon reflexes and muscle weakness, particularly in the proximal muscles. A lumbar puncture reveals elevated protein levels with normal white cell counts in the cerebrospinal fluid, consistent with Guillain-Barré syndrome.",
    "actual_diagnosis": "17. Guillain-Barré syndrome, ICD-10 code G61.0"
  },
  {
    "doctor_vignette": "A 121-year-old male presents with severe fatigue and intermittent pain crises in his joints. Physical examination reveals pallor, jaundice, and swollen hands. Laboratory tests show a hemoglobin level of 6.5 g/dL with significant sickle-shaped cells on the peripheral blood smear and elevated reticulocyte count.",
    "actual_diagnosis": "16. Sickle cell anemia, ICD-10 code D57.9"
  },
  {
    "doctor_vignette": "A 21-year-old male presents with short stature and delayed puberty. Physical exam reveals a height of 5'2\", webbed neck, and broad chest. Labs show elevated FSH and LH levels, and karyotyping confirms a 45,X karyotype. The patient expresses concern about infertility and his appearance.",
    "actual_diagnosis": "19. Turner syndrome, ICD-10 code Q96.9"
  },
  {
    "doctor_vignette": "A 15-year-old female presents with a chief complaint of persistent facial pain and pressure, particularly around the cheeks and forehead, accompanied by nasal congestion and purulent nasal discharge for the past week. On physical examination, tenderness is noted over the maxillary and frontal sinuses, and there is erythema in the nasal mucosa. A CT scan of the sinuses reveals opacification of the maxillary sinuses, consistent with acute sinusitis.",
    "actual_diagnosis": "Acute sinusitis, ICD-10 code J01.90"
  },
  {
    "doctor_vignette": "A 47-year-old male presents with a chief complaint of increasing hand and foot size over the past few years. On physical exam, notable findings include enlarged extremities, facial changes such as prominent jaw and enlarged nasal features, and thickened skin. Laboratory tests reveal elevated insulin-like growth factor 1 (IGF-1) levels and MRI shows a pituitary adenoma.",
    "actual_diagnosis": "20. Acromegaly, ICD-10 code E22.0"
  },
  {
    "doctor_vignette": "An 108-year-old male presents with unintentional weight loss and increased fatigue over the past month. On physical examination, he exhibits tremors, a rapid heart rate of 110 bpm, and a warm, moist skin texture. Thyroid function tests reveal elevated free T4 and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "4. Hyperthyroidism, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 124-year-old male presents with persistent joint pain and stiffness, primarily in his hands and knees. Physical examination reveals swelling and tenderness in multiple joints, along with a decreased range of motion. Laboratory tests show elevated rheumatoid factor and anti-CCP antibodies, with an ESR of 45 mm/hr indicating inflammation.",
    "actual_diagnosis": "7. Rheumatoid arthritis, ICD-10 code M06.9"
  },
  {
    "doctor_vignette": "A 141-year-old female presents with increased shortness of breath and a persistent cough producing yellow sputum. Physical examination reveals wheezing, decreased breath sounds bilaterally, and use of accessory muscles for breathing. A chest X-ray shows hyperinflation of the lungs with an increased anterior-posterior diameter, and pulmonary function tests indicate a significant reduction in FEV1/FVC ratio, confirming airflow obstruction.",
    "actual_diagnosis": "5. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 51-year-old male presents with a chief complaint of itchy, red patches on his forearms and behind his knees that have persisted for several weeks. On physical examination, there are scaly, erythematous lesions with excoriations indicative of scratching. No specific lab tests are needed as the clinical presentation is classic for eczema, although a patch test was negative for allergens.",
    "actual_diagnosis": "8. Eczema, ICD-10 code L30.9"
  },
  {
    "doctor_vignette": "A 60-year-old male presents with a chief complaint of palpitations and shortness of breath that started suddenly two hours ago. Physical examination reveals an irregularly irregular pulse at a rate of 120 beats per minute, along with mild jugular venous distension. An ECG shows atrial fibrillation with no evidence of acute ischemia, and a chest X-ray is unremarkable.",
    "actual_diagnosis": "9. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 53-year-old male presents with chronic diarrhea, abdominal bloating, and unintentional weight loss over the past six months. Physical examination reveals a distended abdomen and signs of malnutrition including dry skin and muscle wasting. Serological tests show elevated tissue transglutaminase antibodies (tTG-IgA) and a low hemoglobin level indicating anemia. An endoscopy with biopsy reveals villous atrophy in the small intestine.",
    "actual_diagnosis": "10. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 91-year-old female presents with recurrent episodes of palpitations, severe headaches, and sweating. On physical examination, her blood pressure is noted to be 180/100 mmHg with a heart rate of 110 bpm. Laboratory tests reveal elevated serum catecholamines and a CT scan shows a 4 cm adrenal mass consistent with pheochromocytoma.",
    "actual_diagnosis": "12. Pheochromocytoma, ICD-10 code C74.1"
  },
  {
    "doctor_vignette": "A 148-year-old female presents with a chief complaint of a painful, blistering rash on her right torso. Physical examination reveals grouped vesicular lesions in a dermatomal distribution, accompanied by erythema and tenderness. The patient also reports prodromal symptoms of fever and malaise one week prior. Laboratory tests show a positive PCR for varicella-zoster virus from the vesicular fluid.",
    "actual_diagnosis": "13. Herpes zoster, ICD-10 code B02.9"
  },
  {
    "doctor_vignette": "A 69-year-old female presents with a chief complaint of persistent low back pain that has worsened over the past month. On physical examination, she demonstrates decreased spinal mobility and tenderness in the lumbar region. A dual-energy X-ray absorptiometry (DEXA) scan reveals a T-score of -2.8, indicating significant bone loss. Her medical history includes menopause at age 50 and a sedentary lifestyle.",
    "actual_diagnosis": "11. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 21-year-old female presents to the emergency department with complaints of severe fatigue and decreased urine output over the past week. On physical examination, she has mild edema in her lower extremities and her blood pressure is elevated at 150/90 mmHg. Laboratory results reveal a serum creatinine level of 3.2 mg/dL, indicating acute kidney injury, with a BUN of 40 mg/dL and urinalysis showing proteinuria and hematuria.",
    "actual_diagnosis": "14. Acute kidney injury, ICD-10 code N17.9"
  },
  {
    "doctor_vignette": "A 103-year-old female presents with a chief complaint of recurrent, debilitating headaches occurring 15 days per month for the past year. On physical examination, she demonstrates tenderness in the temporal area and reports associated symptoms of nausea and photophobia during her episodes. Neurological examination reveals no focal deficits, and an MRI of the brain shows no acute lesions but confirms chronic changes consistent with age.",
    "actual_diagnosis": "15. Chronic migraine, ICD-10 code G43.709"
  },
  {
    "doctor_vignette": "A 49-year-old female presents with excessive daytime sleepiness and episodes of sudden muscle weakness triggered by laughter. During the physical exam, she exhibits signs of cataplexy, with no neurological deficits noted. Polysomnography reveals a short sleep latency and multiple sleep-onset REM periods, confirming the diagnosis.",
    "actual_diagnosis": "18. Narcolepsy, ICD-10 code G47.419"
  },
  {
    "doctor_vignette": "A 37-year-old female presents with persistent cough and recurrent lung infections. On physical examination, she exhibits digital clubbing and wheezing upon auscultation. Chest X-ray reveals hyperinflation and bronchiectasis, while sweat chloride testing shows elevated chloride levels, confirming the diagnosis.",
    "actual_diagnosis": "19. Cystic fibrosis, ICD-10 code E84.9"
  },
  {
    "doctor_vignette": "A 2-year-old male presents with a chief complaint of persistent fever and a rash that has developed over the past week. On physical examination, the child exhibits a butterfly-shaped erythematous rash on the cheeks and is noted to have joint swelling in the knees. Laboratory tests reveal a positive antinuclear antibody (ANA) test and elevated levels of anti-double-stranded DNA antibodies, along with mild anemia.",
    "actual_diagnosis": "16. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 149-year-old male presents with recurrent episodes of joint swelling and pain, particularly in the knees and elbows. Physical examination reveals significant hemarthrosis in both knees and mild bruising on the forearms. Laboratory tests show aPTT prolonged at 45 seconds with normal PT and platelet count, and factor VIII activity is markedly reduced at 3%.",
    "actual_diagnosis": "20. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "An 82-year-old male presents with acute chest pain and shortness of breath. On physical examination, he has pallor and jaundice, with a heart rate of 110 bpm and decreased breath sounds on the left side. A complete blood count reveals hemoglobin of 6.5 g/dL with a high reticulocyte count, and a chest X-ray shows signs of acute chest syndrome. The patient has a known history of sickle cell disease.",
    "actual_diagnosis": "17. Sickle cell disease, ICD-10 code D57.9"
  },
  {
    "doctor_vignette": "A 43-year-old female presents to the emergency department with fever, chills, and severe abdominal pain. On examination, she is tachycardic, hypotensive, and has a distended abdomen with rebound tenderness. Laboratory tests reveal leukocytosis, elevated lactate levels, and blood cultures are positive for E. coli. A CT scan shows perforation of the bowel with associated free air.",
    "actual_diagnosis": "Septic shock, ICD-10 code R65.21"
  },
  {
    "doctor_vignette": "A 137-year-old male presents with a chief complaint of persistent heartburn and regurgitation after meals. Physical examination reveals mild epigastric tenderness but no rebound tenderness or guarding. An esophagogastroduodenoscopy (EGD) shows evidence of erosive esophagitis and a hiatal hernia. The patient reports frequent nocturnal symptoms and has been using over-the-counter antacids with minimal relief.",
    "actual_diagnosis": "Acid reflux disease, ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "A 147-year-old male presents with progressive unilateral hearing loss and occasional tinnitus in the right ear over the past six months. Upon examination, he exhibits diminished auditory acuity and a positive Romberg test, indicating balance issues. MRI of the brain reveals a well-defined mass in the right cerebellopontine angle consistent with an acoustic neuroma.",
    "actual_diagnosis": "Acoustic neuroma, ICD-10 code D33.3"
  },
  {
    "doctor_vignette": "An 84-year-old female presents with persistent nightmares and severe anxiety following a car accident six months ago. On physical exam, she appears withdrawn and exhibits signs of hypervigilance, such as an exaggerated startle response. No critical lab or imaging findings are noted; however, she reports significant distress and avoidance behaviors related to reminders of the trauma.",
    "actual_diagnosis": "Post-traumatic stress disorder, ICD-10 code F43.10"
  },
  {
    "doctor_vignette": "A 79-year-old male presents with a chief complaint of persistent abdominal pain and bloody diarrhea for the past two weeks. Physical examination reveals tenderness in the left lower quadrant and a palpable abdominal mass. Laboratory tests show elevated inflammatory markers (CRP and ESR) and a colonoscopy reveals mucosal ulceration consistent with ulcerative colitis.",
    "actual_diagnosis": "Ulcerative colitis, ICD-10 code K51.90"
  },
  {
    "doctor_vignette": "A 97-year-old female presents with complaints of increasing abdominal swelling and fatigue over the past month. Physical examination reveals ascites, jaundice, and spider angiomas. Laboratory tests show elevated liver enzymes (AST and ALT), low albumin, and a prolonged prothrombin time, while an abdominal ultrasound confirms hepatomegaly and portal hypertension.",
    "actual_diagnosis": "Cirrhosis of the liver, ICD-10 code K74.60"
  },
  {
    "doctor_vignette": "A 40-year-old male presents with progressive muscle weakness and difficulty climbing stairs. On physical examination, he exhibits muscle wasting, particularly in the proximal muscles, and demonstrates a positive Gowers' sign. Serum creatine kinase levels are significantly elevated, and genetic testing reveals a deletion in the dystrophin gene.",
    "actual_diagnosis": "Duchenne muscular dystrophy, ICD-10 code G71.0"
  },
  {
    "doctor_vignette": "A 104-year-old female presents with recurrent abdominal pain and bloating for the past six months, accompanied by alternating diarrhea and constipation. Physical examination reveals a soft abdomen with tenderness in the lower quadrants but no rebound tenderness or guarding. Laboratory tests show normal complete blood count and metabolic panel, with no signs of infection or inflammation. Colorectal imaging is unremarkable, ruling out structural abnormalities.",
    "actual_diagnosis": "Irritable bowel syndrome, ICD-10 code K58.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with progressive chorea and cognitive decline over the past year. On physical examination, she demonstrates involuntary movements of her limbs and facial grimacing, along with mild psychiatric symptoms of depression. Genetic testing reveals the presence of the CAG repeat expansion in the HTT gene, confirming the diagnosis.",
    "actual_diagnosis": "Huntington's disease, ICD-10 code G10"
  },
  {
    "doctor_vignette": "A 92-year-old female presents with a chief complaint of a progressively enlarging neck mass over the past few months. On physical examination, a firm, non-tender nodule is palpated in the right lobe of the thyroid, and there is mild cervical lymphadenopathy. Ultrasound reveals a 3 cm hypoechoic lesion with microcalcifications in the thyroid gland, and fine needle aspiration biopsy confirms malignancy.",
    "actual_diagnosis": "Thyroid carcinoma, ICD-10 code C73"
  },
  {
    "doctor_vignette": "A 126-year-old male presents with persistent heartburn and regurgitation after meals. Physical examination reveals mild epigastric tenderness and no signs of abdominal distension. An upper gastrointestinal endoscopy shows esophagitis consistent with acid reflux, and a pH probe confirms abnormal esophageal acid exposure.",
    "actual_diagnosis": "Esophageal reflux disease, ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "A 90-year-old female presents with progressive dyspnea on exertion over the past six months and a persistent dry cough. Physical examination reveals fine crackles on auscultation bilaterally and clubbing of the fingers. High-resolution CT scan shows reticular opacities and honeycombing in the lower lobes, while pulmonary function tests indicate restrictive lung disease with decreased DLCO.",
    "actual_diagnosis": "Idiopathic pulmonary fibrosis, ICD-10 code J84.112"
  },
  {
    "doctor_vignette": "A 55-year-old female presents with persistent fatigue and pruritus for the past six months. On physical examination, she has xanthomas on her eyelids and dry skin. Laboratory tests reveal elevated alkaline phosphatase levels (450 U/L) and positive antimitochondrial antibodies (AMA). Abdominal ultrasound shows normal biliary tree with no obstruction.",
    "actual_diagnosis": "Primary biliary cholangitis, ICD-10 code K74.3"
  },
  {
    "doctor_vignette": "A 96-year-old male presents with a chief complaint of worsening shortness of breath and productive cough for the past three days. Physical examination reveals crackles on lung auscultation, decreased breath sounds in the right lower lobe, and a temperature of 101°F. Chest X-ray shows right lower lobe consolidation, and sputum culture is positive for Klebsiella pneumoniae.",
    "actual_diagnosis": "Pneumonia due to Klebsiella pneumoniae, ICD-10 code J18.0"
  },
  {
    "doctor_vignette": "A 77-year-old female presents with complaints of persistent headaches and dizziness for the past month. On physical examination, her blood pressure is found to be 160/95 mmHg, and she has mild bilateral retinal changes noted during fundoscopic examination. Laboratory tests show normal electrolytes and kidney function, with no significant findings on chest X-ray.",
    "actual_diagnosis": "5. Hypertension essential (primary), ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 134-year-old male presents with fatigue and decreased appetite over the past month. On physical examination, he has pallor, lower extremity edema, and hypertension. Laboratory tests reveal elevated serum creatinine levels of 3.5 mg/dL and a glomerular filtration rate (GFR) of 25 mL/min, indicating significant renal impairment.",
    "actual_diagnosis": "7. Chronic renal failure, ICD-10 code N18.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with complaints of bilateral knee pain that worsens with activity and improves with rest. On physical examination, there is tenderness and crepitus in both knees, along with decreased range of motion. X-rays show joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "8. Osteoarthritis, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 17-year-old male presents with a chief complaint of itchy, red patches on his elbows and knees that have persisted for several weeks. Physical examination reveals well-defined erythematous plaques covered with silvery scales on extensor surfaces and scalp. No significant laboratory abnormalities are noted, but a skin biopsy shows hyperkeratosis and acanthosis, consistent with psoriasis.",
    "actual_diagnosis": "9. Psoriasis vulgaris, ICD-10 code L40.0"
  },
  {
    "doctor_vignette": "A 105-year-old female presents with a chief complaint of persistent facial pain and pressure, worsening over the past week. Physical examination reveals tenderness over the maxillary sinuses and purulent nasal discharge. A CT scan of the sinuses shows mucosal thickening and fluid levels in the maxillary sinuses, indicating infection. Her vital signs are stable, but she exhibits mild fever and fatigue.",
    "actual_diagnosis": "10. Acute sinusitis, ICD-10 code J01.90"
  },
  {
    "doctor_vignette": "A 126-year-old female presents to the emergency department with acute chest pain radiating to her left arm and shortness of breath. On examination, she exhibits diaphoresis, tachycardia, and an irregular heartbeat. ECG shows ST-segment elevation in the inferior leads, and cardiac troponin levels are significantly elevated. Her medical history includes hypertension and diabetes.",
    "actual_diagnosis": "6. Acute myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 35-year-old male presents with polyuria, polydipsia, and unexplained weight loss over the past month. Upon examination, he has dry mucous membranes and significant fatigue. Laboratory tests reveal a fasting blood glucose level of 250 mg/dL and an HbA1c of 10.5%. Ketones are present in the urine, indicating possible diabetic ketoacidosis.",
    "actual_diagnosis": "4. Diabetes mellitus type 1, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 127-year-old female presents with a chief complaint of wheezing and shortness of breath that has worsened over the past week. On physical examination, she exhibits prolonged expiratory phase and decreased breath sounds bilaterally. A peak flow meter reading shows a significant decline from her baseline, and a chest X-ray reveals hyperinflation of the lungs. Laboratory tests indicate elevated eosinophil levels, suggesting an allergic component to her respiratory symptoms.",
    "actual_diagnosis": "11. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 126-year-old male presents with complaints of unintentional weight loss of 10 pounds over the past month, increased heart rate, and anxiety. On physical examination, he exhibits fine tremors in his hands, a prominent goiter, and warm, moist skin. Laboratory tests reveal elevated serum T4 levels and suppressed TSH, confirming hyperthyroidism.",
    "actual_diagnosis": "12. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 116-year-old male presents with chronic diarrhea, weight loss, and abdominal distension. Physical exam reveals a thin, frail appearance with signs of malnutrition, and abdominal tenderness upon palpation. Laboratory tests show elevated anti-tissue transglutaminase IgA antibodies and low hemoglobin levels indicating anemia.",
    "actual_diagnosis": "13. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 115-year-old female presents with fatigue and joint pain, particularly in her hands and knees. On physical examination, she exhibits a butterfly-shaped rash across her cheeks and nose, as well as bilateral swelling of the wrists. Laboratory tests reveal a positive antinuclear antibody (ANA) test and elevated anti-double-stranded DNA antibodies, indicating an autoimmune process.",
    "actual_diagnosis": "14. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with auditory hallucinations and delusions of persecution, expressing fears that she is being watched. Physical examination reveals disorganized speech and a flat affect. Cognitive testing indicates impaired insight and judgment. No significant abnormalities are found on routine blood tests or brain imaging.",
    "actual_diagnosis": "15. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 78-year-old male presents with severe pain and swelling in his right big toe, which started suddenly last night. On examination, the toe is erythematous, warm, and exquisitely tender to touch. Laboratory tests reveal elevated serum uric acid levels of 8.5 mg/dL and joint aspiration shows needle-shaped crystals under polarized light microscopy.",
    "actual_diagnosis": "16. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 19-year-old male presents with a chief complaint of persistent cough and shortness of breath, especially during physical activity. Physical examination reveals prolonged expiration, wheezing, and diminished breath sounds bilaterally. A chest X-ray shows hyperinflation of the lungs, and spirometry confirms a reduced FEV1/FVC ratio, indicative of airflow obstruction.",
    "actual_diagnosis": "17. Chronic obstructive pulmonary disease (COPD), ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 17-year-old female presents with sudden onset of right-sided facial weakness and inability to close her right eye. On physical examination, there is noticeable drooping of the right side of her face, with an inability to smile or raise her eyebrow on that side. Neurological examination reveals no other deficits, and a CT scan of the brain shows no evidence of stroke or mass effect. There are no significant findings in her laboratory tests, including complete blood count and metabolic panel.",
    "actual_diagnosis": "19. Bell's palsy, ICD-10 code G51.0"
  },
  {
    "doctor_vignette": "A 106-year-old female presents with recurrent joint dislocations and skin that is unusually elastic and fragile. Physical examination reveals hypermobile joints and extensive scarring on her forearms from minor injuries. Genetic testing shows a COL5A1 mutation consistent with Ehlers-Danlos syndrome.",
    "actual_diagnosis": "21. Ehlers-Danlos syndrome, ICD-10 code Q79.6"
  },
  {
    "doctor_vignette": "A 72-year-old female presents with fatigue and pallor. On physical examination, she exhibits conjunctival pallor and a heart rate of 102 bpm. Laboratory results reveal a hemoglobin level of 9.2 g/dL and serum ferritin of 10 ng/mL, indicating iron deficiency anemia.",
    "actual_diagnosis": "18. Anemia due to iron deficiency, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "A 13-year-old female presents with sudden onset of lower extremity weakness and numbness, along with urinary incontinence over the past two days. Physical examination reveals loss of deep tendon reflexes and sensory loss below the T10 level. MRI of the spinal cord shows inflammation at the thoracic region, with no evidence of compression or structural lesions. Laboratory tests reveal elevated IgG index, suggesting intrathecal synthesis of antibodies.",
    "actual_diagnosis": "20. Transverse myelitis, ICD-10 code G37.3"
  },
  {
    "doctor_vignette": "A 94-year-old male presents with fatigue and recent unintentional weight loss. On physical examination, he has xanthomas on his elbows and a blood pressure of 150/90 mmHg. Laboratory results reveal a total cholesterol level of 320 mg/dL and LDL cholesterol of 200 mg/dL, indicating significantly elevated lipid levels.",
    "actual_diagnosis": "23. Hyperlipidemia, ICD-10 code E78.5"
  },
  {
    "doctor_vignette": "A 59-year-old female presents with severe abdominal pain radiating to her back, along with nausea and vomiting. Physical examination reveals tenderness in the epigastric region and guarding. Laboratory tests show elevated serum amylase and lipase levels, and an abdominal ultrasound reveals peritoneal fluid and an enlarged pancreas.",
    "actual_diagnosis": "24. Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 132-year-old male presents with complaints of increased hand and foot size over the past few years, along with noticeable facial changes such as a protruding jaw and enlarged nose. Physical examination reveals coarse facial features, thickened skin, and enlarged extremities. Laboratory tests show elevated insulin-like growth factor 1 (IGF-1) levels, and an MRI of the pituitary gland demonstrates a pituitary adenoma.",
    "actual_diagnosis": "22. Acromegaly, ICD-10 code E22.0"
  },
  {
    "doctor_vignette": "A 46-year-old male presents with widespread musculoskeletal pain and fatigue lasting over six months. Physical examination reveals tenderness in multiple trigger points, along with generalized stiffness. No significant lab abnormalities are noted, including negative rheumatoid factor and normal inflammatory markers. Imaging studies are unremarkable, ruling out other conditions.",
    "actual_diagnosis": "25. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "An 81-year-old female presents with worsening joint pain and swelling in her hands and knees over the past month. On examination, she has dactylitis in her right middle finger and erythematous plaques on her elbows. X-rays reveal joint space narrowing and periarticular bone changes consistent with inflammatory arthritis. Laboratory results show elevated ESR and CRP levels, along with a positive family history of psoriasis.",
    "actual_diagnosis": "Psoriatic arthritis, ICD-10 code L40.50"
  },
  {
    "doctor_vignette": "A 4-year-old male presents with persistent abdominal pain and fatigue. On physical examination, he has a noticeable bronze skin discoloration and hepatomegaly. Laboratory results reveal elevated serum ferritin levels and transferrin saturation of 90%.",
    "actual_diagnosis": "Hereditary hemochromatosis, ICD-10 code E83.110"
  },
  {
    "doctor_vignette": "A 2-year-old female presents with developmental delays and jaundice. On physical examination, she displays hepatomegaly and has a characteristic Kayser-Fleischer ring noted during ophthalmologic evaluation. Laboratory tests reveal elevated serum copper levels and low serum ceruloplasmin, confirming the suspicion of Wilson’s disease.",
    "actual_diagnosis": "Wilson’s disease, ICD-10 code E83.00"
  },
  {
    "doctor_vignette": "A 44-year-old female presents with a 5-day history of high fever, conjunctivitis, and a rash. On examination, she has cracked lips, cervical lymphadenopathy, and swelling of the hands and feet. Laboratory tests reveal elevated inflammatory markers, including C-reactive protein and erythrocyte sedimentation rate, and echocardiogram shows mild coronary artery dilation.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I72.0"
  },
  {
    "doctor_vignette": "A 39-year-old male presents with excessive fatigue, weight gain, and increased body hair. Physical examination reveals hypertension and signs of secondary sexual characteristic changes such as gynecomastia. Laboratory tests show elevated 17-hydroxyprogesterone levels and low cortisol, indicating adrenal insufficiency.",
    "actual_diagnosis": "Congenital adrenal hyperplasia, ICD-10 code E25.0"
  },
  {
    "doctor_vignette": "A 99-year-old female presents with severe muscle pain and weakness after a fall at home. On physical examination, she exhibits significant tenderness in her lower extremities and decreased range of motion. Laboratory tests reveal elevated serum creatine kinase levels (CK) of 15,000 U/L and myoglobinuria. Her urine dipstick shows a positive result for blood, indicating the presence of myoglobin.",
    "actual_diagnosis": "Rhabdomyolysis, ICD-10 code M62.82"
  },
  {
    "doctor_vignette": "A 44-year-old female presents with complaints of increasing shortness of breath and palpitations. On examination, she is noted to have a tall stature, arachnodactyly, and a loud systolic murmur indicative of aortic regurgitation. An echocardiogram reveals dilation of the aortic root, consistent with Marfan syndrome.",
    "actual_diagnosis": "Marfan syndrome, ICD-10 code Q87.40"
  },
  {
    "doctor_vignette": "A 70-year-old male presents with progressive dysphagia for solids and liquids over the past six months, accompanied by regurgitation of undigested food and weight loss of 15 pounds. Upon physical examination, he appears malnourished, and auscultation reveals decreased bowel sounds. A barium swallow study shows a dilated esophagus with incomplete lower esophageal sphincter relaxation, consistent with achalasia.",
    "actual_diagnosis": "Achalasia, ICD-10 code K22.0"
  },
  {
    "doctor_vignette": "A 134-year-old male presents with increasing pain and discomfort in his right arm. On physical examination, multiple café-au-lait spots and neurofibromas are noted on his skin, particularly on the trunk and extremities. A recent MRI of the brain shows no tumors, but the presence of plexiform neurofibromas is confirmed in the cervical region. Genetic testing reveals a mutation in the NF1 gene.",
    "actual_diagnosis": "Neurofibromatosis type 1, ICD-10 code Q85.00"
  },
  {
    "doctor_vignette": "A 135-year-old male presents with episodic headaches, palpitations, and severe hypertension. On examination, his blood pressure is consistently elevated at 210/110 mmHg, and he exhibits signs of pallor and diaphoresis. Laboratory tests reveal elevated serum catecholamines and a CT scan shows a hypervascular adrenal mass consistent with pheochromocytoma.",
    "actual_diagnosis": "Pheochromocytoma, ICD-10 code C74.9"
  },
  {
    "doctor_vignette": "A 1-year-old male presents with a chief complaint of lethargy and decreased appetite. On physical examination, he is noted to have pallor and mild splenomegaly. Laboratory results reveal a hemoglobin level of 8.5 g/dL with normal reticulocyte count and elevated inflammatory markers. Further evaluation shows a chronic infection contributing to his anemia.",
    "actual_diagnosis": "Anemia due to chronic disease, ICD-10 code D63.9"
  },
  {
    "doctor_vignette": "A 25-year-old male presents to the emergency department with a chief complaint of severe headache, fever, and neck stiffness. On physical examination, he exhibits photophobia and a positive Brudzinski's sign. Lumbar puncture reveals cloudy cerebrospinal fluid with a high white blood cell count and elevated protein levels, consistent with bacterial meningitis. Blood cultures confirm the presence of Streptococcus pneumoniae.",
    "actual_diagnosis": "Bacterial meningitis, ICD-10 code A87.9"
  },
  {
    "doctor_vignette": "A 93-year-old male presents with a chief complaint of persistent headaches for the past week. On physical examination, his blood pressure is recorded at 180/95 mmHg, and he exhibits mild left ventricular hypertrophy on an echocardiogram. No acute distress is noted, but he has a history of non-compliance with antihypertensive medications.",
    "actual_diagnosis": "4. Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 96-year-old female presents with social withdrawal and difficulty in communication, expressing frustration over her inability to connect with family members. Physical examination reveals a lack of eye contact and repetitive hand movements. No significant abnormalities were found in routine laboratory tests or imaging, suggesting no underlying neurological disorders.",
    "actual_diagnosis": "Asperger syndrome, ICD-10 code F84.0"
  },
  {
    "doctor_vignette": "A 121-year-old male presents with worsening shortness of breath and fatigue over the past month. Physical examination reveals elevated blood pressure at 190/100 mmHg, a third heart sound (S3), and bilateral lower extremity edema. An echocardiogram shows left ventricular hypertrophy and reduced ejection fraction, confirming the diagnosis.",
    "actual_diagnosis": "Hypertensive heart disease, ICD-10 code I11.9"
  },
  {
    "doctor_vignette": "A 39-year-old female presents with a chief complaint of severe mood swings, characterized by episodes of heightened energy and irritability followed by deep depressive phases. Physical exam reveals rapid speech and increased motor activity during manic episodes, along with a flat affect during depressive phases. No significant abnormalities were found in routine lab tests, and a mood chart shows alternating periods of mania and depression over the past year.",
    "actual_diagnosis": "9. Bipolar disorder, ICD-10 code F31.9"
  },
  {
    "doctor_vignette": "A 107-year-old male presents with worsening shortness of breath and persistent edema in his lower extremities. Physical examination reveals bilateral crackles upon auscultation and pitting edema up to the knees. A chest X-ray shows cardiomegaly and pulmonary congestion, while BNP levels are significantly elevated at 900 pg/mL.",
    "actual_diagnosis": "8. Congestive heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 3-year-old male presents with a chief complaint of persistent knee pain and difficulty in walking. Physical examination reveals swelling and tenderness over the right knee, with limited range of motion and crepitus noted during flexion and extension. An X-ray shows joint space narrowing and subchondral sclerosis, indicating degenerative changes consistent with early-onset osteoarthritis.",
    "actual_diagnosis": "7. Osteoarthritis, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 144-year-old female presents with increased thirst and frequent urination over the past month. Physical examination reveals a BMI of 32, dry mucous membranes, and a glucose level of 220 mg/dL. Laboratory tests show an elevated HbA1c of 8.5%, indicating poor glycemic control.",
    "actual_diagnosis": "5. Type 2 diabetes mellitus, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 53-year-old male presents with persistent fatigue, joint pain in the hands and knees, and a rash on his face that worsens with sun exposure. Physical examination reveals a malar rash and bilateral swelling of the joints. Laboratory tests show positive antinuclear antibodies (ANA) and elevated anti-double-stranded DNA antibodies. His complement levels are low, indicating ongoing inflammation.",
    "actual_diagnosis": "11. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 22-year-old male presents with fatigue and a family history of heart disease. Physical examination reveals a BMI of 28 and xanthomas on his elbows. Laboratory results indicate a total cholesterol level of 280 mg/dL and triglycerides at 200 mg/dL, confirming dyslipidemia.",
    "actual_diagnosis": "14. Hyperlipidemia, ICD-10 code E78.5"
  },
  {
    "doctor_vignette": "A 51-year-old male presents to the emergency department with complaints of decreased urine output and fatigue over the past week. On physical examination, he is found to have elevated blood pressure, mild edema in the lower extremities, and dry mucous membranes. Laboratory tests reveal a serum creatinine level of 4.2 mg/dL and a blood urea nitrogen (BUN) of 30 mg/dL, indicating acute renal failure.",
    "actual_diagnosis": "13. Acute renal failure, ICD-10 code N17.9"
  },
  {
    "doctor_vignette": "A 22-year-old female presents with a chief complaint of sudden onset pain and swelling in her right big toe, which began overnight. On physical exam, the affected joint is erythematous, warm, and tender to palpation. Laboratory tests reveal elevated serum uric acid levels of 8.5 mg/dL, and a joint aspiration shows needle-shaped monosodium urate crystals under polarized light microscopy.",
    "actual_diagnosis": "15. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "An 81-year-old female presents with a chief complaint of itchy, red patches on her elbows and scalp that have persisted for several weeks. Upon examination, there are well-demarcated, erythematous plaques covered with silvery scales on her extensor surfaces and scalp. No significant laboratory abnormalities are noted, and a skin biopsy confirms the diagnosis of psoriasis.",
    "actual_diagnosis": "12. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 3-year-old female presents with a chief complaint of unusual behaviors, including talking to imaginary friends and displaying disorganized play. During the physical exam, she shows signs of social withdrawal and has difficulty engaging with her caregiver. No significant findings were noted on laboratory tests or imaging, which were performed to rule out other conditions.",
    "actual_diagnosis": "17. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 149-year-old male presents with persistent wheezing and shortness of breath, particularly at night. On examination, he exhibits prolonged expiratory phase and bilateral wheezing on auscultation. Peak expiratory flow rate is measured at 50% of his predicted value, indicating significant obstruction. Chest X-ray shows hyperinflation, consistent with asthma exacerbation.",
    "actual_diagnosis": "16. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 46-year-old female presents with fatigue and weakness for the past month. On physical examination, she is pale and has a heart rate of 102 beats per minute. Laboratory tests reveal a hemoglobin level of 10.2 g/dL and a mean corpuscular volume (MCV) of 78 fL, indicating microcytic anemia. No sources of bleeding are identified on further evaluation.",
    "actual_diagnosis": "19. Anemia, unspecified, ICD-10 code D64.9"
  },
  {
    "doctor_vignette": "A 135-year-old female presents with severe fatigue and episodes of joint pain. On examination, she exhibits pallor and jaundice, with notable swelling in her hands and feet. Laboratory results reveal a hemoglobin level of 7.5 g/dL with the presence of sickle-shaped red blood cells on a peripheral blood smear.",
    "actual_diagnosis": "20. Sickle cell disease, ICD-10 code D57.9"
  },
  {
    "doctor_vignette": "A 96-year-old male presents with persistent dry mouth and dry eyes, reporting difficulty swallowing and a gritty sensation in his eyes. Physical examination reveals swollen parotid glands and conjunctival injection. Laboratory tests show positive anti-SSA/Ro antibodies and reduced salivary flow on sialography.",
    "actual_diagnosis": "24. Sjögren's syndrome, ICD-10 code M35.0"
  },
  {
    "doctor_vignette": "A 119-year-old male presents with a chief complaint of widespread musculoskeletal pain and fatigue lasting for several months. Physical examination reveals tenderness in multiple trigger points and a decrease in range of motion, but no signs of inflammation or joint swelling. Routine lab tests show normal results, and imaging studies are unremarkable, ruling out other conditions.",
    "actual_diagnosis": "21. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 19-year-old female presents with persistent right arm pain and numbness, especially after prolonged periods of studying or using her laptop. Physical examination reveals a positive Adson's test and diminished radial pulse on the affected side. MRI of the neck shows an anatomical variant with mild compression of the brachial plexus. Electromyography indicates signs of nerve compression consistent with thoracic outlet syndrome.",
    "actual_diagnosis": "23. Thoracic outlet syndrome, ICD-10 code G54.0"
  },
  {
    "doctor_vignette": "A 129-year-old female presents with joint pain and frequent bruising. On examination, her skin is hyperelastic and she has hypermobile joints, particularly in her fingers and knees. Notably, she has experienced multiple joint dislocations over the past year. Genetic testing reveals a mutation consistent with Ehlers-Danlos syndrome.",
    "actual_diagnosis": "25. Ehlers-Danlos syndrome, ICD-10 code Q79.6"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of increasing shortness of breath and a chronic cough that has worsened over the past few months. On physical examination, she exhibits wheezing, decreased breath sounds bilaterally, and clubbing of the fingers. A chest X-ray reveals hyperinflation of the lungs, and spirometry shows a FEV1/FVC ratio of 0.55, indicating obstructive lung disease.",
    "actual_diagnosis": "Chronic obstructive pulmonary disease (COPD), ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "An 110-year-old female presents with a chief complaint of recurrent, unilateral headaches that have intensified over the past week. On physical examination, she exhibits mild photophobia and tenderness in the temporal region, but no neurological deficits are noted. Vital signs are stable, and a CT scan of the head shows no acute intracranial abnormalities, ruling out other causes of headache.",
    "actual_diagnosis": "Migraine without aura, ICD-10 code G43.909"
  },
  {
    "doctor_vignette": "A 133-year-old female presents with persistent heartburn and regurgitation, particularly after meals. On physical examination, she exhibits epigastric tenderness but no signs of acute distress. An upper gastrointestinal endoscopy reveals esophageal inflammation and no structural abnormalities. A pH probe test confirms a low esophageal pH, consistent with acid reflux disease.",
    "actual_diagnosis": "Acid reflux disease (Gastroesophageal reflux disease), ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "An 82-year-old female presents with persistent feelings of unease and excessive worry about her health and family. On physical examination, she exhibits mild tremors and a notable increase in heart rate, but no other significant findings. Laboratory tests, including a complete blood count and thyroid function tests, return within normal ranges. No imaging studies were performed as there were no indications of acute pathology.",
    "actual_diagnosis": "Anxiety disorder, ICD-10 code F41.9"
  },
  {
    "doctor_vignette": "An 88-year-old female presents with a chief complaint of persistent itchy rashes on her arms and legs. Physical examination reveals dry, erythematous patches with excoriations and lichenification. No significant lab results are indicated, as the condition is diagnosed clinically without the need for imaging.",
    "actual_diagnosis": "Eczema (Atopic dermatitis), ICD-10 code L20.9"
  },
  {
    "doctor_vignette": "A 95-year-old male presents with fatigue and a rash on his face, which he describes as a butterfly-shaped erythematous lesion. Physical examination reveals mucosal ulcers and joint swelling in his hands. Laboratory tests show a positive antinuclear antibody (ANA) test and low complement levels, suggesting an autoimmune process.",
    "actual_diagnosis": "Lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 130-year-old male presents with increasing forgetfulness and confusion over the past year. Physical examination reveals disorientation to time and place, with mild aphasia and impaired judgment. Neuroimaging shows significant cortical atrophy consistent with neurodegenerative changes. Routine laboratory tests are unremarkable, ruling out metabolic causes of cognitive decline.",
    "actual_diagnosis": "Alzheimer's disease, ICD-10 code G30.9"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with a chief complaint of persistent cough and difficulty breathing for the past three days. Physical exam reveals decreased breath sounds on the right side, dullness to percussion, and a fever of 102°F. Chest X-ray shows right lower lobe consolidation consistent with pneumonia. A complete blood count indicates leukocytosis with a left shift.",
    "actual_diagnosis": "Pneumonia, ICD-10 code J18.9"
  },
  {
    "doctor_vignette": "A 9-year-old female presents with persistent neck pain and stiffness, especially after prolonged periods of reading or using electronic devices. Physical examination reveals reduced range of motion in the cervical spine and tenderness along the cervical paravertebral muscles. X-rays show mild degenerative changes in the cervical vertebrae, consistent with early spondylosis.",
    "actual_diagnosis": "Cervical spondylosis, ICD-10 code M47.12"
  },
  {
    "doctor_vignette": "A 120-year-old female presents with complaints of irregular menstrual cycles and hirsutism. On physical examination, she has a body mass index (BMI) of 32 and exhibits acanthosis nigricans. Laboratory tests reveal elevated androgen levels and an ultrasound shows multiple cysts on the ovaries. These findings are consistent with her diagnosis.",
    "actual_diagnosis": "Polycystic ovary syndrome, ICD-10 code E28.2"
  },
  {
    "doctor_vignette": "A 111-year-old male presents with abdominal swelling and persistent abdominal pain. On physical examination, a palpable mass is noted in the lower abdomen, and the patient exhibits signs of ascites. Imaging studies reveal an enlarged left adnexal mass consistent with ovarian pathology. CA-125 levels are significantly elevated, suggesting malignancy.",
    "actual_diagnosis": "Ovarian cancer, ICD-10 code C56.9"
  },
  {
    "doctor_vignette": "A 35-year-old male presents with a chief complaint of persistent fatigue lasting over six months, which worsens after minimal exertion. Physical examination reveals mild lymphadenopathy and no signs of infection or other systemic illness. Laboratory tests, including complete blood count and thyroid function, return normal, with no abnormalities detected on imaging studies.",
    "actual_diagnosis": "Chronic fatigue syndrome, ICD-10 code G93.3"
  },
  {
    "doctor_vignette": "A 122-year-old male presents with fatigue and decreased appetite over the past month. Physical examination reveals mild edema in the lower extremities and a blood pressure of 150/90 mmHg. Laboratory tests show a serum creatinine level of 1.8 mg/dL and an estimated glomerular filtration rate (eGFR) of 45 mL/min, indicating stage 3 chronic kidney disease.",
    "actual_diagnosis": "Chronic kidney disease, stage 3, ICD-10 code N18.3"
  },
  {
    "doctor_vignette": "A 76-year-old male presents with severe pain and swelling in his right lower leg, with overlying erythema and a fever of 101.5°F. Physical exam reveals necrotic tissue at the site with a foul odor and crepitus. MRI shows extensive soft tissue edema and fascial involvement, confirming the suspicion of necrotizing fasciitis.",
    "actual_diagnosis": "Necrotizing fasciitis, ICD-10 code M72.6"
  },
  {
    "doctor_vignette": "A 104-year-old female presents with fatigue and jaundice. On physical examination, she exhibits scleral icterus and mild abdominal tenderness in the right upper quadrant. Laboratory tests reveal elevated liver enzymes (ALT 300 U/L, AST 250 U/L) and positive Hepatitis C antibody. A subsequent HCV RNA test confirms active infection.",
    "actual_diagnosis": "Hepatitis C, ICD-10 code B18.2"
  },
  {
    "doctor_vignette": "A 115-year-old female presents with a chief complaint of palpitations and shortness of breath. On physical examination, her heart rate is found to be 130 beats per minute, and she exhibits slight jugular venous distension. An ECG reveals sinus tachycardia, and basic metabolic panel shows mild hypokalemia. ",
    "actual_diagnosis": "Tachycardia, ICD-10 code R00.0"
  },
  {
    "doctor_vignette": "A 38-year-old male presents to the clinic with complaints of persistent headaches and occasional dizziness. On physical examination, his blood pressure is measured at 150/95 mmHg, and he is found to have mild bilateral retinal changes. Routine laboratory tests reveal elevated serum creatinine levels, indicating possible renal involvement.",
    "actual_diagnosis": "1. Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 93-year-old female presents with increased thirst and frequent urination over the past month. Physical examination reveals a BMI of 32, and her skin shows signs of dryness. Laboratory results indicate a fasting blood glucose level of 180 mg/dL and HbA1c of 8.2%.",
    "actual_diagnosis": "2. Type 2 diabetes mellitus, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 36-year-old female presents to the emergency department with a chief complaint of severe headache, fever, and confusion. On physical examination, she exhibits signs of meningeal irritation, including a positive Brudzinski's sign, and she appears disoriented. A CT scan of the head shows unilateral temporal lobe edema, and lumbar puncture reveals elevated white blood cell count with a predominance of lymphocytes and positive PCR for Herpes Simplex Virus. ",
    "actual_diagnosis": "Herpes simplex encephalitis, ICD-10 code B00.3"
  },
  {
    "doctor_vignette": "A 140-year-old female presents with a chief complaint of worsening shortness of breath and wheezing, especially during exertion. Upon physical examination, she displays a prolonged expiratory phase and bilateral wheezing on auscultation. Peak expiratory flow rate testing shows a significant reduction of 60% from her baseline, indicating obstructive airway disease. Chest X-ray reveals hyperinflation but no acute abnormalities.",
    "actual_diagnosis": "3. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 110-year-old male presents with a chief complaint of bilateral knee pain, worsening over the past year. Physical examination reveals crepitus and tenderness in both knees, with a range of motion limited to 90 degrees. X-rays show joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "5. Osteoarthritis, ICD-10 code M15.9"
  },
  {
    "doctor_vignette": "A 57-year-old male presents with a chief complaint of persistent sadness and loss of interest in activities he once enjoyed. On physical exam, he exhibits psychomotor retardation, flat affect, and difficulty concentrating during the assessment. Laboratory tests reveal normal thyroid function and a complete blood count, ruling out other causes of his symptoms.",
    "actual_diagnosis": "6. Major depressive disorder, ICD-10 code F33.1"
  },
  {
    "doctor_vignette": "A 54-year-old female presents with severe abdominal pain radiating to the back, associated with nausea and vomiting. On physical examination, she exhibits rebound tenderness and guarding in the upper abdomen. Laboratory tests reveal elevated serum amylase and lipase levels, and an abdominal ultrasound shows peritoneal fluid and an enlarged pancreas. These findings are consistent with acute pancreatitis.",
    "actual_diagnosis": "7. Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 60-year-old male presents with a chief complaint of itchy, red patches on his elbows and knees that have persisted for several months. Physical examination reveals well-defined, erythematous plaques covered with silvery scales on extensor surfaces. No laboratory tests are necessary for diagnosis, but a skin biopsy confirms the presence of psoriatic lesions.",
    "actual_diagnosis": "10. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 101-year-old female presents with fatigue and generalized weakness. Physical examination reveals pallor, a heart rate of 110 bpm, and a systolic murmur. Laboratory tests show a hemoglobin level of 8 g/dL and low serum ferritin levels, indicating iron deficiency.",
    "actual_diagnosis": "11. Anemia due to iron deficiency, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a chief complaint of recurrent episodes of loss of consciousness and muscle jerking lasting about 1-2 minutes over the past month. Physical examination reveals no focal neurological deficits, and she appears well-nourished and in no acute distress. An EEG shows generalized spike-and-wave discharges consistent with generalized epilepsy, and MRI of the brain is unremarkable.",
    "actual_diagnosis": "12. Epilepsy, ICD-10 code G40.909"
  },
  {
    "doctor_vignette": "A 7-year-old male presents with chronic diarrhea and abdominal distension for the past three months. On physical examination, he is noted to have weight loss and a distended abdomen with tenderness in the epigastric region. Laboratory tests reveal elevated tissue transglutaminase IgA antibodies and a decreased hemoglobin level, indicating possible malabsorption.",
    "actual_diagnosis": "9. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of persistent heartburn and regurgitation after meals. On physical examination, he demonstrates mild epigastric tenderness but has no signs of acute distress. An upper endoscopy reveals erosive esophagitis consistent with gastroesophageal reflux disease. A pH study confirms abnormal esophageal acid exposure.",
    "actual_diagnosis": "14. Gastroesophageal reflux disease, ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "A 111-year-old female presents with widespread joint pain and fatigue over the past month. Physical examination reveals a malar rash across her cheeks, and she has bilateral swelling in the wrists and knees. Laboratory tests show a positive antinuclear antibody (ANA) test and elevated erythrocyte sedimentation rate (ESR), indicating inflammation.",
    "actual_diagnosis": "13. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 20-year-old female presents with a chief complaint of unintentional weight loss and increased heart rate over the past month. Physical examination reveals exophthalmos, a fine tremor in her hands, and a rapid heart rate of 120 beats per minute. Laboratory tests show elevated free T4 and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "15. Hyperthyroidism, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 117-year-old female presents with auditory hallucinations and paranoid delusions, claiming that her caregivers are plotting against her. Physical examination reveals disorganized speech and a flat affect. No significant findings are noted in her routine lab work or imaging studies, ruling out other organic causes. The patient's history reveals episodes of confusion and social withdrawal over the past few months.",
    "actual_diagnosis": "16. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 7-year-old male presents with a chief complaint of decreased urine output for the past two days. Physical examination reveals mild edema and elevated blood pressure. Laboratory results show a serum creatinine level of 2.5 mg/dL and a blood urea nitrogen (BUN) of 40 mg/dL, indicating acute kidney injury.",
    "actual_diagnosis": "17. Acute kidney injury, ICD-10 code N17.9"
  },
  {
    "doctor_vignette": "A 141-year-old female presents with a chief complaint of persistent numbness and tingling in her right hand, particularly affecting the thumb, index, and middle fingers. On physical examination, Tinel's sign and Phalen's maneuver are positive. Nerve conduction studies reveal delayed median nerve conduction at the wrist, consistent with carpal tunnel syndrome.",
    "actual_diagnosis": "18. Carpal tunnel syndrome, ICD-10 code G56.00"
  },
  {
    "doctor_vignette": "A 131-year-old male presents with a chief complaint of a rapidly enlarging, asymmetrical mole on his back that has changed in color over the past month. Physical examination reveals a 2 cm irregularly shaped lesion with a dark brown to black hue and irregular borders. Lymphadenopathy is noted in the left axilla. A biopsy confirms the diagnosis of malignant melanoma.",
    "actual_diagnosis": "20. Malignant melanoma of skin, ICD-10 code C43.9"
  },
  {
    "doctor_vignette": "A 60-year-old male presents with a chief complaint of persistent joint pain and stiffness, particularly in the hands and knees, that worsens in the morning. Physical examination reveals swelling and tenderness in multiple joints, with a notable ulnar deviation of the fingers. Laboratory tests show positive rheumatoid factor and elevated anti-CCP antibodies, along with increased ESR and CRP levels.",
    "actual_diagnosis": "19. Rheumatoid arthritis, ICD-10 code M06.9"
  },
  {
    "doctor_vignette": "A 79-year-old male presents to the emergency department with difficulty breathing and swelling of the face and throat after eating shrimp. Physical examination reveals wheezing, urticaria, and hypotension. Initial lab results show elevated serum tryptase levels and a significant drop in oxygen saturation. The patient reports no prior history of shellfish allergies.",
    "actual_diagnosis": "Anaphylaxis, ICD-10 code T78.2"
  },
  {
    "doctor_vignette": "A 91-year-old female presents with progressive shortness of breath and fatigue over the past month. On physical examination, she exhibits bilateral lower extremity edema and a third heart sound (S3) on auscultation. An echocardiogram reveals left ventricular dilation and reduced ejection fraction of 35%. Serum BNP levels are significantly elevated at 800 pg/ml, indicating heart failure.",
    "actual_diagnosis": "Dilated cardiomyopathy, ICD-10 code I42.0"
  },
  {
    "doctor_vignette": "A 135-year-old male presents with complaints of excessive daytime sleepiness and loud snoring, reported by his caregiver. Physical examination reveals obesity, a thick neck, and hypertension. Overnight polysomnography shows recurrent apneas and hypopneas with significant oxygen desaturation. No other significant lab abnormalities are noted.",
    "actual_diagnosis": "Sleep apnea, ICD-10 code G47.30"
  },
  {
    "doctor_vignette": "A 110-year-old female presents with sudden onset of right-sided facial droop and inability to close her right eye. On physical examination, there is notable asymmetry in her facial movements, with weakness in the right upper and lower face, while the forehead is affected. No significant findings are noted on CT imaging of the head, and laboratory tests reveal no signs of infection or other underlying pathology.",
    "actual_diagnosis": "Bell's palsy, ICD-10 code G51.0"
  },
  {
    "doctor_vignette": "A 114-year-old male presents with a chief complaint of recurrent severe headaches occurring every few weeks, often accompanied by nausea and sensitivity to light. Physical examination reveals a mildly elevated blood pressure but is otherwise unremarkable with no neurological deficits. A CT scan of the head shows no acute intracranial abnormalities, ruling out other causes of headache.",
    "actual_diagnosis": "Migraine, ICD-10 code G43.909"
  },
  {
    "doctor_vignette": "A 132-year-old male presents with recurrent episodes of involuntary jerking movements and loss of consciousness that have been occurring for the past six months. On physical examination, he exhibits postictal confusion and muscle soreness, but no focal neurological deficits are noted. EEG findings reveal generalized spike-and-wave discharges, consistent with seizure activity. MRI of the brain shows no structural abnormalities.",
    "actual_diagnosis": "Epilepsy, ICD-10 code G40.9"
  },
  {
    "doctor_vignette": "An 87-year-old male presents with a chief complaint of worsening shortness of breath and a productive cough for the past three days. On physical examination, he exhibits decreased breath sounds and crackles in the right lower lung field. Chest X-ray reveals right lower lobe consolidation, and laboratory tests show elevated white blood cell count with a left shift, indicating infection.",
    "actual_diagnosis": "Pneumonia due to unspecified organism, ICD-10 code J18.9"
  },
  {
    "doctor_vignette": "A 91-year-old female presents with a chief complaint of right lower abdominal pain that began 24 hours ago, accompanied by nausea and decreased appetite. Physical examination reveals tenderness in the right lower quadrant with rebound tenderness and guarding. Laboratory tests show elevated white blood cell count (WBC 15,000/uL) and a CT scan confirms an enlarged, inflamed appendix.",
    "actual_diagnosis": "Acute appendicitis, ICD-10 code K35.9"
  },
  {
    "doctor_vignette": "A 124-year-old female presents with acute onset of fever, palpitations, and confusion. On examination, she is tachycardic with a heart rate of 150 bpm, and exhibits tremors and a prominent goiter. Laboratory tests reveal a significantly elevated free T4 level and suppressed TSH, confirming hyperthyroidism. Chest X-ray shows signs of heart failure, consistent with thyroid storm.",
    "actual_diagnosis": "Thyroid storm, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 92-year-old male presents with a chief complaint of rectal bleeding and discomfort during bowel movements. Physical examination reveals external hemorrhoids, which are swollen and tender, as well as mild anemia on lab results with a hemoglobin level of 10.2 g/dL. No imaging is necessary as the clinical findings are consistent with the diagnosis.",
    "actual_diagnosis": "Hemorrhoids, ICD-10 code I84.9"
  },
  {
    "doctor_vignette": "A 23-year-old female presents to the emergency department with a chief complaint of palpitations and shortness of breath for the past hour. On physical examination, her heart rate is 130 beats per minute, blood pressure is 110/70 mmHg, and she appears anxious. An ECG shows sinus tachycardia with no ischemic changes, and basic metabolic panel reveals normal electrolyte levels.",
    "actual_diagnosis": "Tachycardia, unspecified, ICD-10 code R00.0"
  },
  {
    "doctor_vignette": "A 117-year-old male presents with a complaint of bilateral breast tenderness and palpable lumps in the breast tissue. Physical examination reveals multiple, mobile, and tender cystic masses in both breasts, with no overlying skin changes. A mammogram shows dense breast tissue with multiple cysts, consistent with fibrocystic changes. No significant abnormalities are noted in laboratory tests.",
    "actual_diagnosis": "Fibrocystic breast disease, ICD-10 code N60.1"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with a chief complaint of recurrent hives for the past three months, accompanied by intense itching. Physical examination reveals multiple raised, erythematous wheals on his trunk and extremities, with no signs of angioedema. Laboratory tests, including a complete blood count and thyroid function tests, return normal, ruling out other underlying conditions.",
    "actual_diagnosis": "Chronic urticaria, ICD-10 code L50.9"
  },
  {
    "doctor_vignette": "A 26-year-old male presents with a chief complaint of persistent facial pressure and nasal congestion for the past three months. Physical examination reveals tenderness over the maxillary sinuses and postnasal drip. A CT scan of the sinuses shows mucosal thickening in the maxillary and ethmoid sinuses, consistent with chronic sinusitis.",
    "actual_diagnosis": "Chronic sinusitis, ICD-10 code J32.9"
  },
  {
    "doctor_vignette": "A 58-year-old male presents with a chief complaint of persistent fever lasting for over five days. Physical examination reveals conjunctival injection, erythematous rash, cervical lymphadenopathy, and cracking of the lips. Laboratory tests show an elevated erythrocyte sedimentation rate (ESR) and thrombocytosis, while echocardiography indicates mild coronary artery dilation.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I72.5"
  },
  {
    "doctor_vignette": "A 4-year-old male presents with progressive difficulty in using his right hand for daily activities and a noticeable decline in coordination. Physical examination reveals rigidity and bradykinesia on the right side, along with a marked asymmetry in reflexes. MRI of the brain shows atrophy of the right parietal lobe and basal ganglia, supporting the suspicion of corticobasal degeneration.",
    "actual_diagnosis": "Corticobasal degeneration, ICD-10 code G31.83"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of itchy, purplish papules on her wrists and ankles that have persisted for several weeks. Physical examination reveals multiple flat-topped, polygonal lesions with a lace-like pattern on the oral mucosa. There are no signs of infection, and a biopsy of the skin confirms a diagnosis of lichenoid tissue change without malignancy.",
    "actual_diagnosis": "Lichen planus, ICD-10 code L43.9"
  },
  {
    "doctor_vignette": "A 107-year-old male presents with severe epigastric pain and nausea for the past week. Physical examination reveals tenderness in the epigastric region and signs of anemia, including pallor. A gastroscopy shows a bleeding gastric ulcer, and lab tests indicate low hemoglobin levels and elevated urea, suggesting significant gastrointestinal bleeding.",
    "actual_diagnosis": "Gastric ulcer, ICD-10 code K25.9"
  },
  {
    "doctor_vignette": "A 15-year-old female presents with fatigue, unexplained weight loss, and recurrent infections over the past month. Physical exam reveals splenomegaly and pallor. Complete blood count shows elevated white blood cell count with a high percentage of immature granulocytes and a positive Philadelphia chromosome test.",
    "actual_diagnosis": "Chronic myeloid leukemia, ICD-10 code C92.1"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with fatigue and pallor. On physical examination, he has mild splenomegaly and a noticeable pallor of the conjunctiva. Complete blood count reveals microcytic anemia with hemoglobin levels at 9 g/dL and elevated levels of fetal hemoglobin. Iron studies show normal iron levels, suggesting a non-iron deficiency anemia.",
    "actual_diagnosis": "Thalassemia, ICD-10 code D56.9"
  },
  {
    "doctor_vignette": "A 147-year-old female presents with a non-healing ulcerated lesion on her right cheek that has persisted for several months. Physical examination reveals a pearly, raised border with telangiectasia surrounding the ulceration. A biopsy confirms the diagnosis of basal cell carcinoma, and no lymphadenopathy is noted on examination. Imaging shows no signs of metastasis, confirming localized disease.",
    "actual_diagnosis": "Basal cell carcinoma, ICD-10 code C44.91"
  },
  {
    "doctor_vignette": "A 129-year-old male presents with increasing fatigue and weakness over the past month. On physical examination, he is pale, with a heart rate of 110 bpm and a blood pressure of 100/60 mmHg. Laboratory tests reveal a hemoglobin level of 8.5 g/dL and a mean corpuscular volume (MCV) of 78 fL, indicating microcytic anemia. No obvious source of bleeding is noted on further investigation.",
    "actual_diagnosis": "Anemia, unspecified, ICD-10 code D64.9"
  },
  {
    "doctor_vignette": "A 51-year-old female presents with a persistent cough lasting over three weeks, accompanied by night sweats and weight loss. Physical examination reveals decreased breath sounds in the right lung and dullness to percussion. A chest X-ray shows right upper lobe consolidation, and sputum analysis reveals acid-fast bacilli.",
    "actual_diagnosis": "Tuberculosis, unspecified, ICD-10 code A15.9"
  },
  {
    "doctor_vignette": "A 141-year-old male presents with a chief complaint of worsening cough and shortness of breath over the past week. Physical examination reveals decreased breath sounds and crackles in the right lower lung field, along with a fever of 101°F. Chest X-ray shows right lower lobe opacity consistent with pneumonia, and blood tests indicate elevated white blood cell count.",
    "actual_diagnosis": "Pneumonia, unspecified organism, ICD-10 code J18.9"
  },
  {
    "doctor_vignette": "A 5-year-old male presents with growth failure and delayed puberty. On physical examination, he exhibits short stature for his age, decreased muscle mass, and diminished body hair. Laboratory tests reveal low levels of growth hormone, ACTH, and LH, consistent with pituitary dysfunction.",
    "actual_diagnosis": "Hypopituitarism, ICD-10 code E23.0"
  },
  {
    "doctor_vignette": "A 41-year-old male presents to the emergency department with chest pain radiating to his left arm and shortness of breath that started 30 minutes ago. On physical examination, he is diaphoretic, with a blood pressure of 150/90 mmHg and a heart rate of 110 bpm. An ECG shows ST-segment elevation in the anterior leads, and cardiac troponin I levels are markedly elevated. ",
    "actual_diagnosis": "7. Myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 41-year-old male presents with fatigue and decreased urine output over the past month. Physical examination reveals mild edema in the lower extremities and hypertension (BP 150/95 mmHg). Laboratory tests show an elevated serum creatinine level of 2.5 mg/dL and a glomerular filtration rate (GFR) of 30 mL/min, indicating impaired kidney function.",
    "actual_diagnosis": "9. Chronic kidney disease, ICD-10 code N18.9"
  },
  {
    "doctor_vignette": "A 38-year-old female presents with a chief complaint of persistent shortness of breath and wheezing, particularly at night. On physical examination, she exhibits prolonged expiratory phase and diffuse wheezing bilaterally. Peak expiratory flow rate measured in the office is 60% of her predicted value, indicating significant airflow obstruction. Chest X-ray shows no acute abnormalities, supporting the diagnosis of asthma exacerbation.",
    "actual_diagnosis": "6. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 139-year-old male presents with chronic diarrhea and significant weight loss over the past three months. Physical examination reveals abdominal distension and signs of malnutrition, including muscle wasting. Laboratory tests show elevated tissue transglutaminase antibodies and a low hemoglobin level, indicating anemia. A small bowel biopsy confirms villous atrophy consistent with celiac disease.",
    "actual_diagnosis": "11. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 56-year-old female presents to the emergency department with chief complaint of difficulty breathing and hives after eating shrimp. On physical exam, she exhibits wheezing, facial swelling, and generalized urticaria. Vital signs show hypotension with a blood pressure of 80/50 mmHg. Laboratory results reveal elevated serum tryptase levels consistent with an anaphylactic reaction.",
    "actual_diagnosis": "Anaphylaxis due to food, ICD-10 code T78.2"
  },
  {
    "doctor_vignette": "A 39-year-old female presents with a chief complaint of unintentional weight loss and increased heart rate over the past month. On physical exam, she demonstrates hyperhidrosis, a fine tremor in her hands, and exophthalmos. Laboratory results reveal a suppressed TSH level and elevated free T4, confirming hyperthyroidism.",
    "actual_diagnosis": "13. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "An 89-year-old male presents to the emergency department with palpitations and shortness of breath that started abruptly. On physical examination, his heart rate is irregularly irregular at 130 beats per minute, and he has mild bilateral lower extremity edema. An ECG reveals atrial fibrillation with no evident acute ischemic changes, and his electrolytes show slight hypokalemia.",
    "actual_diagnosis": "14. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 133-year-old female presents with increasing memory loss and confusion over the past year. Physical examination reveals disorientation to time and place, along with difficulty following simple commands. Brain MRI shows global atrophy typical of neurodegenerative conditions, and cognitive testing demonstrates significant impairment in memory recall and executive function.",
    "actual_diagnosis": "16. Alzheimer’s disease, ICD-10 code G30.9"
  },
  {
    "doctor_vignette": "A 64-year-old female presents with a chief complaint of persistent joint pain and swelling in her hands and knees for the past three months. On physical examination, there is notable bilateral synovitis and morning stiffness lasting over an hour. Laboratory tests reveal positive rheumatoid factor and elevated anti-CCP antibodies, along with increased ESR and CRP levels indicating inflammation.",
    "actual_diagnosis": "12. Rheumatoid arthritis, ICD-10 code M06.9"
  },
  {
    "doctor_vignette": "A 29-year-old female presents with a chief complaint of persistent itchy rashes on her arms and neck for the past month. On physical examination, there are erythematous, scaly patches with lichenification noted in the flexural areas. A patch test reveals no allergens, and skin scraping is negative for fungal elements.",
    "actual_diagnosis": "17. Eczema, ICD-10 code L30.9"
  },
  {
    "doctor_vignette": "A 14-year-old male presents with a chief complaint of persistent cough and shortness of breath, especially during physical activity. On physical examination, he exhibits wheezing and decreased breath sounds bilaterally. A chest X-ray shows hyperinflation of the lungs, and pulmonary function tests indicate reduced FEV1/FVC ratio consistent with obstructive lung disease. The patient has a history of significant exposure to secondhand smoke.",
    "actual_diagnosis": "19. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 50-year-old male presents with severe pain and swelling in his right big toe, which began suddenly overnight. On physical examination, the affected joint is erythematous and warm to touch, with limited range of motion due to pain. Serum uric acid levels are markedly elevated at 9.5 mg/dL, confirming the diagnosis.",
    "actual_diagnosis": "18. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 111-year-old male presents with fatigue and joint pain, particularly in the hands and knees. On physical examination, he shows a butterfly rash across his cheeks and erythematous lesions on his forearms. Laboratory tests reveal a positive antinuclear antibody (ANA) test and elevated double-stranded DNA antibodies, indicating an autoimmune process.",
    "actual_diagnosis": "20. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 7-year-old male presents with persistent fatigue, weight loss, and recurrent abdominal pain. On physical examination, he has hyperpigmentation of the skin, particularly in the creases and mucous membranes, along with low blood pressure. Laboratory tests reveal hyponatremia, hyperkalemia, and elevated ACTH levels, indicative of adrenal insufficiency.",
    "actual_diagnosis": "21. Addison’s disease, ICD-10 code E27.1"
  },
  {
    "doctor_vignette": "A 49-year-old male presents with chronic widespread pain and fatigue lasting over six months. Physical exam reveals tenderness in multiple trigger points, particularly in the neck, shoulders, and lower back. No significant abnormalities are noted in routine lab tests, including complete blood count and inflammatory markers, which are within normal limits. Imaging studies, including X-rays, show no evidence of joint degeneration or other musculoskeletal abnormalities.",
    "actual_diagnosis": "22. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 17-year-old female presents with persistent fatigue and unexplained weight loss over the past month. Physical examination reveals lymphadenopathy in the cervical and axillary regions, and splenomegaly is noted. A complete blood count shows elevated lymphocyte levels and a chest CT scan indicates enlarged mediastinal lymph nodes.",
    "actual_diagnosis": "Non-Hodgkin lymphoma, ICD-10 code C85.9"
  },
  {
    "doctor_vignette": "A 128-year-old female presents with recurrent back pain and a recent history of a hip fracture after a minor fall. On physical examination, she exhibits kyphosis and reduced spinal mobility. A DEXA scan reveals a T-score of -3.5, indicating severe osteoporosis. Laboratory tests show normal calcium and vitamin D levels.",
    "actual_diagnosis": "25. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 128-year-old female presents with worsening shortness of breath and fatigue over the past month. On examination, she has elevated blood pressure of 180/95 mmHg, a third heart sound (S3), and bilateral lower extremity edema. An echocardiogram reveals left ventricular hypertrophy and diastolic dysfunction, and her BNP level is significantly elevated at 500 pg/mL.",
    "actual_diagnosis": "23. Hypertensive heart disease, ICD-10 code I11.9"
  },
  {
    "doctor_vignette": "A 147-year-old male presents with a chief complaint of social withdrawal and difficulty communicating with family members. On physical examination, he demonstrates stereotypical hand movements and limited eye contact. Neurodevelopmental assessments reveal persistent deficits in social communication and interaction, with no significant abnormalities in MRI imaging. Laboratory tests show normal metabolic function, supporting the diagnosis of Autism spectrum disorder.",
    "actual_diagnosis": "Autism spectrum disorder, ICD-10 code F84.0"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with a chief complaint of severe headache and neck stiffness for the past two days. On physical examination, he exhibits photophobia and a positive Brudzinski's sign. Lumbar puncture reveals cloudy cerebrospinal fluid with a white blood cell count of 800 cells/mm³, predominantly neutrophils, and positive cultures for Streptococcus pneumoniae.",
    "actual_diagnosis": "24. Bacterial meningitis, ICD-10 code A87.9"
  },
  {
    "doctor_vignette": "A 138-year-old female presents with persistent fatigue and unexplained weight loss over the past three months. Physical examination reveals significant cervical lymphadenopathy and splenomegaly. A chest X-ray shows mediastinal lymphadenopathy, and a biopsy of the lymph node confirms Reed-Sternberg cells. Blood work shows elevated LDH levels and anemia.",
    "actual_diagnosis": "Hodgkin's lymphoma, ICD-10 code C81.9"
  },
  {
    "doctor_vignette": "A 106-year-old female presents with persistent fatigue and swelling in her lower extremities. Physical examination reveals a heart rate of 110 bpm, and the patient exhibits bilateral leg edema. A serologic test confirms the presence of Trypanosoma cruzi antibodies, indicating Chagas disease.",
    "actual_diagnosis": "Chagas disease, ICD-10 code B57.1"
  },
  {
    "doctor_vignette": "A 114-year-old female presents with a chief complaint of worsening knee pain, particularly during ambulation. Physical examination reveals crepitus and tenderness over the medial compartment of both knees, with limited range of motion. X-rays show joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "Knee osteoarthritis, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 102-year-old female presents with severe daytime fatigue and frequent episodes of waking at night. Physical examination reveals obesity and a prominent neck circumference of 16 inches. Pulse oximetry shows intermittent oxygen desaturation during sleep, with a recorded apnea-hypopnea index of 32 events per hour on overnight polysomnography. The patient reports loud snoring and gasping for air, especially noted by her caregivers.",
    "actual_diagnosis": "Sleep apnea, ICD-10 code G47.33"
  },
  {
    "doctor_vignette": "A 26-year-old female presents to the emergency department with a chief complaint of fever and chills for the past three days. On physical examination, she is tachycardic with a heart rate of 120 bpm, hypotensive with a blood pressure of 88/54 mmHg, and has warm, flushed skin. Laboratory results show a white blood cell count of 18,000 cells/mm³, elevated lactate levels at 4.5 mmol/L, and a positive blood culture for Escherichia coli.",
    "actual_diagnosis": "Severe sepsis, ICD-10 code R65.20"
  },
  {
    "doctor_vignette": "A 10-year-old female presents with a chief complaint of progressive muscle weakness and a rash on her eyelids and knuckles. Physical examination reveals heliotrope rash, Gottron's papules, and muscle tenderness. Laboratory tests show elevated creatine kinase levels and positive anti-Jo-1 antibodies, confirming muscle inflammation.",
    "actual_diagnosis": "Dermatomyositis, ICD-10 code M33.9"
  },
  {
    "doctor_vignette": "An 18-year-old male presents to the emergency department with a chief complaint of decreased urination and fatigue over the past three days. Physical examination reveals dry mucous membranes and a blood pressure of 90/60 mmHg. Laboratory tests show elevated serum creatinine levels of 4.2 mg/dL and a blood urea nitrogen (BUN) of 48 mg/dL, indicating acute renal failure. Urinalysis reveals concentrated urine with a specific gravity of 1.030 and few renal tubular epithelial cells.",
    "actual_diagnosis": "Acute renal failure, ICD-10 code N17.9"
  },
  {
    "doctor_vignette": "A 16-year-old female presents with a chief complaint of persistent cough and fever for three days. Physical examination reveals tachypnea, decreased breath sounds on the right side, and dullness to percussion. Chest X-ray shows a right lower lobe infiltrate consistent with pneumonia. Complete blood count indicates leukocytosis with a left shift.",
    "actual_diagnosis": "Pneumonia, unspecified, ICD-10 code J18.9"
  },
  {
    "doctor_vignette": "A 122-year-old male presents with severe agitation, palpitations, and fever. On examination, he is tachycardic at 150 bpm, has a temperature of 39.5°C, and displays tremors and altered mental status. Laboratory tests reveal elevated free T4 levels and suppressed TSH, confirming hyperthyroidism.",
    "actual_diagnosis": "Thyroid storm, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 36-year-old female presents with a chief complaint of persistent itchy rashes on her arms and neck that have worsened over the past month. On physical examination, there are erythematous patches with scaling and excoriation, particularly in flexural areas. No significant lab results were noted; a skin biopsy ruled out other dermatitis types, supporting the diagnosis.",
    "actual_diagnosis": "Eczema, unspecified, ICD-10 code L30.9"
  },
  {
    "doctor_vignette": "A 64-year-old male presents with a chief complaint of a painful rash on the right side of his chest that started two days ago. On physical exam, there are clustered vesicular lesions on an erythematous base in a dermatomal distribution, accompanied by tenderness to palpation. A Tzanck smear reveals multinucleated giant cells, supporting the diagnosis.",
    "actual_diagnosis": "Herpes zoster, ICD-10 code B02.9"
  },
  {
    "doctor_vignette": "A 143-year-old male presents to the emergency department with a chief complaint of fever and confusion. On physical examination, he is noted to have tachycardia, hypotension, and a temperature of 102°F. Laboratory results reveal elevated white blood cell count, elevated lactate levels, and signs of acute kidney injury. No specific organism is identified in blood cultures.",
    "actual_diagnosis": "Sepsis, unspecified organism, ICD-10 code A41.9"
  },
  {
    "doctor_vignette": "A 20-year-old female presents with persistent bone pain in her pelvis and lower back. On physical examination, there is tenderness over the hip and enlargement of the femur. X-rays reveal an abnormal thickening of the pelvic bones and cortical bone expansion. Serum alkaline phosphatase levels are significantly elevated, indicating increased bone turnover.",
    "actual_diagnosis": "Paget's disease of bone, ICD-10 code M88.9"
  },
  {
    "doctor_vignette": "A 121-year-old female presents with complaints of extreme fatigue and weight gain over the past few months. On physical examination, she shows dry skin, bradycardia, and swelling of the face and extremities. Laboratory tests reveal an elevated TSH level and low free T4, indicating hypothyroidism.",
    "actual_diagnosis": "Hypothyroidism, unspecified, ICD-10 code E03.9"
  },
  {
    "doctor_vignette": "A 126-year-old male presents with worsening fatigue and bone pain, particularly in the lumbar region. On physical examination, he exhibits pallor, tenderness over the spine, and noticeable bruising. Laboratory results reveal an elevated serum protein level with a monoclonal spike and a significant decrease in hemoglobin, alongside skeletal X-rays showing lytic lesions in the vertebrae.",
    "actual_diagnosis": "Multiple myeloma, ICD-10 code C90.00"
  },
  {
    "doctor_vignette": "A 94-year-old male presents with a chief complaint of increasing discomfort from multiple skin nodules. Physical examination reveals neurofibromas on his trunk and extremities, as well as café-au-lait spots on his back. Imaging studies show no evidence of significant central nervous system involvement, but numerous subcutaneous tumors are noted. His family history is positive for similar skin lesions, suggestive of a genetic predisposition.",
    "actual_diagnosis": "Neurofibromatosis, ICD-10 code Q85.00"
  },
  {
    "doctor_vignette": "A 39-year-old male presents with a chief complaint of recurrent wheezing and shortness of breath, especially at night and after exercise. On physical exam, he exhibits prolonged expiration and diffuse wheezing bilaterally. Spirometry reveals a reduced FEV1/FVC ratio, indicating airflow obstruction that improves with bronchodilator use.",
    "actual_diagnosis": "7. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 93-year-old female presents with persistent knee pain, especially during ambulation. On examination, there is notable crepitus and limited range of motion in both knees, with tenderness on palpation. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "9. Osteoarthritis, ICD-10 code M15.9"
  },
  {
    "doctor_vignette": "An 8-year-old male presents to the emergency department with severe chest pain radiating to his left arm and shortness of breath. On physical examination, he is diaphoretic, with a heart rate of 120 bpm and blood pressure of 90/60 mmHg. An ECG shows ST-segment elevation in the anterior leads, and cardiac troponin levels are significantly elevated. These findings suggest acute myocardial infarction.",
    "actual_diagnosis": "8. Acute myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 75-year-old female presents with a chief complaint of severe pain and swelling in her right big toe that started suddenly the night before. On physical exam, the affected joint is erythematous, warm, and exquisitely tender to touch. Laboratory tests reveal elevated serum uric acid levels of 9.2 mg/dL, confirming the diagnosis.",
    "actual_diagnosis": "13. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 144-year-old female presents with fatigue and occasional chest discomfort. Physical examination reveals a body mass index of 32 and xanthomas on her elbows. Laboratory tests show total cholesterol levels of 320 mg/dL and triglycerides of 200 mg/dL, indicating significant dyslipidemia.",
    "actual_diagnosis": "11. Hyperlipidemia, ICD-10 code E78.5"
  },
  {
    "doctor_vignette": "A 24-year-old female presents to the emergency department after experiencing a generalized tonic-clonic seizure lasting approximately three minutes. On physical examination, she is postictal, with confusion and muscle soreness noted. A head MRI shows no structural abnormalities, and routine blood tests including electrolytes and glucose are within normal limits. The patient reports a history of similar episodes occurring intermittently over the past year.",
    "actual_diagnosis": "14. Epilepsy, ICD-10 code G40.909"
  },
  {
    "doctor_vignette": "A 41-year-old male presents with complaints of increasing shortness of breath and fatigue over the past month. On physical exam, he has bilateral lower extremity edema and an elevated jugular venous pressure. A chest X-ray shows cardiomegaly, and a BNP level is markedly elevated at 600 pg/mL, indicating heart failure.",
    "actual_diagnosis": "16. Heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 123-year-old male presents with fatigue and weakness over the past month. On physical exam, he is pale and exhibits tachycardia. Laboratory results show a hemoglobin level of 9.0 g/dL and low serum ferritin levels. There are no signs of acute bleeding or chronic disease.",
    "actual_diagnosis": "18. Iron deficiency anemia, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "An 85-year-old female presents with fatigue and joint pain in her hands and knees. On physical examination, she has a malar rash and tenderness in multiple joints. Laboratory tests reveal positive antinuclear antibodies (ANA) and low complement levels. A urinalysis shows proteinuria, suggesting potential kidney involvement.",
    "actual_diagnosis": "19. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 110-year-old male presents with persistent abdominal pain and diarrhea for several weeks. Physical examination reveals tenderness in the right lower quadrant and signs of weight loss. Laboratory tests show elevated C-reactive protein (CRP) and anemia, while a CT scan reveals segmental thickening of the ileum consistent with inflammatory bowel disease.",
    "actual_diagnosis": "15. Crohn's disease, ICD-10 code K50.90"
  },
  {
    "doctor_vignette": "An 85-year-old female presents with gradual vision loss and difficulty seeing in low light. Upon examination, her intraocular pressure is measured at 28 mmHg, and a visual field test reveals significant peripheral vision loss. Fundoscopic examination shows cupping of the optic nerve head, consistent with glaucoma. She has no significant past ocular history and denies any acute eye pain.",
    "actual_diagnosis": "20. Glaucoma, ICD-10 code H40.9"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with severe fatigue and persistent swelling in his legs. On physical examination, he has a blood pressure of 180/100 mmHg, bilateral pitting edema in the lower extremities, and a notable decrease in urine output. Laboratory results reveal a serum creatinine level of 8.5 mg/dL and an estimated GFR of 10 mL/min, indicating significant renal impairment.",
    "actual_diagnosis": "21. End-stage renal disease, ICD-10 code N18.6"
  },
  {
    "doctor_vignette": "A 48-year-old female presents with sudden onset right-sided facial weakness and drooping of the right corner of the mouth, which began this morning. On physical examination, she exhibits inability to close her right eye and a loss of nasolabial fold on that side. Neurological examination reveals normal strength in extremities and intact sensation. A CT scan of the head shows no evidence of acute intracranial pathology, supporting the diagnosis of Bell's palsy.",
    "actual_diagnosis": "22. Bell's palsy, ICD-10 code G51.0"
  },
  {
    "doctor_vignette": "A 100-year-old male presents with a chief complaint of severe back pain after a fall at home. On physical examination, he exhibits kyphosis and tenderness over the thoracic spine. A lateral spine X-ray reveals vertebral compression fractures at T12 and L1. Laboratory tests show normal calcium levels but elevated alkaline phosphatase, indicating potential bone turnover.",
    "actual_diagnosis": "24. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "An 118-year-old female presents with fatigue and unexplained weight gain over the past few months. On physical examination, she exhibits dry skin, bradycardia, and a notable goiter. Laboratory tests reveal elevated TSH levels of 12.5 mIU/L and low free T4 levels of 0.7 ng/dL, indicating an underactive thyroid.",
    "actual_diagnosis": "23. Hypothyroidism, ICD-10 code E03.9"
  },
  {
    "doctor_vignette": "An 108-year-old female presents with persistent fatigue and joint pain in her hands and knees. Physical examination reveals a malar rash across her cheeks and nose, along with swollen joints. Laboratory tests show elevated anti-nuclear antibodies (ANA) and low complement levels, consistent with systemic lupus erythematosus.",
    "actual_diagnosis": "Lupus erythematosus, systemic, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 114-year-old female presents with a chief complaint of persistent heartburn and regurgitation that has worsened over the past month. Physical examination reveals tenderness in the epigastric region and a dry cough. An upper gastrointestinal endoscopy shows esophagitis, and a pH monitoring test confirms acid reflux. ",
    "actual_diagnosis": "Gastroesophageal reflux disease, ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "A 98-year-old female presents with a chief complaint of severe headache and altered mental status. On examination, she exhibits nuchal rigidity, photophobia, and confusion. Lumbar puncture reveals cloudy cerebrospinal fluid with a high white blood cell count, predominantly neutrophils, and positive gram stain for Streptococcus pneumoniae. Blood cultures are also positive for the same organism.",
    "actual_diagnosis": "25. Bacterial meningitis, ICD-10 code A87.9"
  },
  {
    "doctor_vignette": "A 134-year-old female presents with severe right upper quadrant abdominal pain and fever. On examination, she demonstrates rebound tenderness and guarding in the right upper quadrant. Ultrasound reveals gallbladder wall thickening and the presence of gallstones. Laboratory tests show elevated white blood cell count and liver function tests within normal limits.",
    "actual_diagnosis": "Cholecystitis, ICD-10 code K81.9"
  },
  {
    "doctor_vignette": "An 11-year-old male presents with recurrent abdominal pain and significant discomfort during bowel movements. Physical examination reveals tenderness in the lower abdomen and a palpable mass in the pelvic area. An ultrasound shows the presence of endometrial-like tissue outside the uterus, consistent with endometriosis.",
    "actual_diagnosis": "Endometriosis, ICD-10 code N80.9"
  },
  {
    "doctor_vignette": "A 113-year-old female presents with persistent pain and swelling in her right knee for the past month. On physical examination, there is notable tenderness, swelling, and limited range of motion in the affected joint, with a palpable mass. X-rays reveal an aggressive bone lesion with a sunburst pattern and soft tissue extension, raising suspicion for malignancy. MRI confirms the presence of a high-grade osteosarcoma originating from the distal femur.",
    "actual_diagnosis": "Osteosarcoma, ICD-10 code C40.0"
  },
  {
    "doctor_vignette": "A 144-year-old male presents with acute confusion and a fever of 102°F. Physical examination reveals hypotension (BP 80/50 mmHg), tachycardia (heart rate 120 bpm), and cold, clammy skin. Laboratory results show elevated white blood cell count (21,000/mm³), positive blood cultures for gram-negative bacteria, and metabolic acidosis with a lactate level of 4.5 mmol/L.",
    "actual_diagnosis": "Septicemia, ICD-10 code A41.9"
  },
  {
    "doctor_vignette": "A 32-year-old male presents with increasing memory loss and difficulty concentrating over the past year. Neurological examination reveals mild disorientation to time and place, as well as impaired short-term memory. Brain MRI shows nonspecific atrophy but no acute findings. Routine laboratory tests, including thyroid function and vitamin B12 levels, are within normal limits.",
    "actual_diagnosis": "Dementia, unspecified, ICD-10 code F03.90"
  },
  {
    "doctor_vignette": "A 5-year-old female presents with confusion and difficulty walking, having been recently diagnosed with a severe gastrointestinal disorder leading to malnutrition. On exam, she demonstrates nystagmus and ataxia. Blood tests reveal low thiamine levels and MRI shows symmetric lesions in the thalamus and hypothalamus. The family reports a poor dietary intake due to her illness.",
    "actual_diagnosis": "Wernicke's encephalopathy, ICD-10 code G93.89"
  },
  {
    "doctor_vignette": "A 141-year-old female presents with a chief complaint of persistent joint pain and difficulty walking. Physical examination reveals short stature, disproportionately short limbs, and a prominent forehead. X-rays show characteristic features of achondroplasia, including shortened long bones and a normal-sized trunk. No metabolic abnormalities are detected in her routine lab work.",
    "actual_diagnosis": "Achondroplasia, ICD-10 code Q77.4"
  },
  {
    "doctor_vignette": "A 115-year-old female presents with a chief complaint of uncomfortable sensations in her legs, making it difficult for her to relax and sleep at night. Physical examination reveals mild edema in the lower extremities, but neurological examination is otherwise unremarkable. Lab tests show normal complete blood count and metabolic panel, with no signs of anemia or electrolyte imbalances, ruling out secondary causes.",
    "actual_diagnosis": "Restless legs syndrome, ICD-10 code G25.81"
  },
  {
    "doctor_vignette": "A 14-year-old female presents with complaints of dry eyes and a persistent dry mouth for the past six months. On examination, she has enlarged parotid glands and decreased tear production noted on Schirmer's test. Laboratory results reveal positive anti-Ro (SS-A) antibodies and a low saliva flow rate.",
    "actual_diagnosis": "Sjögren's syndrome, ICD-10 code M35.0"
  },
  {
    "doctor_vignette": "An 84-year-old male presents with a chief complaint of painful vesicular lesions on his lips and around his mouth that started two days ago. Physical examination reveals multiple clustered vesicles on an erythematous base, and he reports fever and malaise. A PCR test of the lesion fluid confirms the presence of Herpes simplex virus.",
    "actual_diagnosis": "Herpes simplex virus infection, ICD-10 code B00.9"
  },
  {
    "doctor_vignette": "A 43-year-old male presents with persistent fatigue and unexplained weight loss over the past three months. On physical examination, notable findings include enlarged cervical lymph nodes and splenomegaly. A chest CT scan reveals mediastinal lymphadenopathy, and a lymph node biopsy confirms the diagnosis.",
    "actual_diagnosis": "Hodgkin lymphoma, ICD-10 code C81.9"
  },
  {
    "doctor_vignette": "A 7-year-old female presents with a chief complaint of ear pain and fever for two days. Physical examination reveals a bulging, erythematous left tympanic membrane and tenderness upon palpation of the ear. There is also a presence of purulent discharge noted in the ear canal. No imaging is required as the clinical presentation is consistent with acute otitis media.",
    "actual_diagnosis": "Acute otitis media, ICD-10 code H65.9"
  },
  {
    "doctor_vignette": "A 20-year-old female presents to the emergency department with a chief complaint of excessive thirst and frequent urination for the past week. Physical examination reveals dry mucous membranes and a weight loss of 5 kg since her last visit. Laboratory tests show a blood glucose level of 350 mg/dL and the presence of ketones in the urine.",
    "actual_diagnosis": "5. Type 1 diabetes mellitus, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "An 82-year-old male presents with a chief complaint of persistent knee pain, particularly worsening with activity and improving with rest. Physical examination reveals bilateral knee tenderness, crepitus on movement, and limited range of motion. X-rays show joint space narrowing and osteophyte formation in both knees, indicating degenerative changes.",
    "actual_diagnosis": "6. Osteoarthritis, ICD-10 code M15.9"
  },
  {
    "doctor_vignette": "A 107-year-old male presents with increasing confusion and difficulty with daily activities over the past six months. Physical examination reveals cognitive impairment with disorientation to time and place, along with mild hemiparesis on the right side. Neuroimaging shows multiple small infarcts in the white matter consistent with vascular changes. Laboratory tests indicate no significant metabolic derangements.",
    "actual_diagnosis": "Vascular dementia, ICD-10 code F01.50"
  },
  {
    "doctor_vignette": "A 91-year-old male presents with persistent abdominal pain and weight loss over the past three months. On physical examination, he exhibits signs of malnutrition, including muscle wasting and pallor. Laboratory tests reveal elevated tissue transglutaminase antibodies (tTG-IgA) and low hemoglobin levels. Additionally, a small intestine biopsy indicates villous atrophy consistent with celiac disease.",
    "actual_diagnosis": "7. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 142-year-old female presents with unintentional weight loss and palpitations for the past month. On examination, she has a fine tremor, increased sweating, and a rapid heart rate of 110 beats per minute. Laboratory tests reveal elevated free T4 and suppressed TSH levels, indicating hyperthyroidism.",
    "actual_diagnosis": "10. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 21-year-old female presents with a chief complaint of itchy, red patches on her elbows and knees that have persisted for several weeks. Physical examination reveals well-defined, erythematous plaques covered with silvery-white scales, particularly on extensor surfaces. No significant lab findings are noted, but a skin biopsy confirms the diagnosis of psoriasis.",
    "actual_diagnosis": "9. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "An 85-year-old female presents with a chief complaint of severe headache and confusion lasting two days. On examination, she exhibits nuchal rigidity, photophobia, and altered mental status. Cerebrospinal fluid analysis reveals a high white blood cell count with predominance of neutrophils, low glucose levels, and elevated protein, consistent with bacterial meningitis.",
    "actual_diagnosis": "11. Bacterial meningitis, ICD-10 code A87.9"
  },
  {
    "doctor_vignette": "A 102-year-old male presents with sudden onset of decreased urine output and severe fatigue. On physical exam, he is found to be hypotensive with dry mucous membranes and mild edema in the lower extremities. Laboratory tests reveal elevated serum creatinine levels of 3.5 mg/dL and a BUN of 45 mg/dL, indicating acute kidney injury. Urinalysis shows the presence of casts and protein, further supporting the diagnosis.",
    "actual_diagnosis": "12. Acute renal failure, ICD-10 code N17.9"
  },
  {
    "doctor_vignette": "A 130-year-old female presents with severe abdominal pain radiating to the back and nausea. Physical examination reveals tenderness in the epigastric region and a low-grade fever. Laboratory tests show elevated serum lipase and amylase levels, while an abdominal ultrasound indicates the presence of gallstones and peritoneal fluid. ",
    "actual_diagnosis": "15. Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 5-year-old female presents to the emergency department with complaints of palpitations and intermittent dizziness. On physical examination, she is noted to have an irregularly irregular pulse and a heart rate of 180 beats per minute. An ECG reveals atrial fibrillation with rapid ventricular response, and a chest X-ray shows no significant abnormalities. Blood tests indicate mild hypokalemia.",
    "actual_diagnosis": "16. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 121-year-old male presents with fatigue and weakness over the past month. On physical examination, he is pale, with a heart rate of 102 bpm and a blood pressure of 110/70 mmHg. Laboratory results show a hemoglobin level of 9.5 g/dL, elevated C-reactive protein indicating inflammation, and normal iron studies, suggesting anemia due to chronic disease.",
    "actual_diagnosis": "13. Anemia due to chronic disease, ICD-10 code D63.8"
  },
  {
    "doctor_vignette": "A 144-year-old male presents with persistent widespread musculoskeletal pain and fatigue for the past six months. Physical examination reveals tenderness in multiple tender points, particularly in the neck, shoulders, and lower back, with no signs of joint swelling. Laboratory tests, including complete blood count and inflammatory markers, are within normal limits, and imaging studies show no abnormalities. His symptoms have significantly impacted his daily activities and quality of life.",
    "actual_diagnosis": "17. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 98-year-old male presents with a chief complaint of uncontrollable shaking in his hands, particularly noticeable while trying to eat. On physical examination, he exhibits a bilateral postural tremor of the hands, which worsens with movement but improves with rest. Neurological examination reveals no other focal deficits, and routine laboratory tests, including thyroid function and metabolic panel, are within normal limits. Imaging studies of the brain show no acute abnormalities, ruling out other causes of tremor.",
    "actual_diagnosis": "19. Essential tremor, ICD-10 code G25.0"
  },
  {
    "doctor_vignette": "A 44-year-old female presents with a chief complaint of severe ear pain in the right ear for the past two days, accompanied by a low-grade fever. On physical examination, there is notable erythema and bulging of the tympanic membrane in the right ear, with decreased mobility on pneumatic otoscopy. The patient reports recent upper respiratory symptoms, and a rapid strep test is negative, ruling out streptococcal infection.",
    "actual_diagnosis": "Acute otitis media, ICD-10 code H66.90"
  },
  {
    "doctor_vignette": "An 87-year-old female presents with blurred vision in her left eye and difficulty reading. On examination, she has cotton wool spots and retinal hemorrhages in both eyes. Fundoscopic examination reveals microaneurysms and exudates. Her recent HbA1c level is 9.2%, indicating poor glycemic control.",
    "actual_diagnosis": "Diabetic retinopathy, ICD-10 code E11.359"
  },
  {
    "doctor_vignette": "A 75-year-old male presents with a chief complaint of increasing shortness of breath and a productive cough with green sputum over the past month. Physical examination reveals prolonged expiratory phase, wheezing bilaterally, and use of accessory muscles for breathing. A chest X-ray shows hyperinflation of the lungs, and spirometry indicates a FEV1/FVC ratio of 0.55, confirming airflow obstruction.",
    "actual_diagnosis": "8. Chronic obstructive pulmonary disease (COPD), ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 35-year-old male presents with worsening fatigue and tremors over the past month. On physical examination, he demonstrates fine tremors of the hands and a Kayser-Fleischer ring in both eyes. Laboratory tests reveal elevated serum copper levels and decreased ceruloplasmin. MRI of the brain shows basal ganglia changes consistent with Wilson's disease.",
    "actual_diagnosis": "Wilson's disease, ICD-10 code E83.01"
  },
  {
    "doctor_vignette": "A 24-year-old female presents with joint hypermobility and frequent joint dislocations, particularly in her shoulders and knees. On physical examination, skin elasticity is noted to be significantly increased, and bruising is easily observed. A family history of similar symptoms is reported, and genetic testing reveals a mutation consistent with Ehlers-Danlos syndrome.",
    "actual_diagnosis": "20. Ehlers-Danlos syndrome, ICD-10 code Q79.6"
  },
  {
    "doctor_vignette": "A 113-year-old female presents with fatigue and palpitations. Physical examination reveals a heart rate of 110 bpm and a heart murmur. An electrocardiogram shows signs of arrhythmia, and serological tests confirm the presence of Trypanosoma cruzi antibodies.",
    "actual_diagnosis": "Chagas disease, ICD-10 code B57.9"
  },
  {
    "doctor_vignette": "A 148-year-old female presents with a high fever lasting five days, conjunctival injection, and a rash on her trunk and extremities. Physical examination reveals cervical lymphadenopathy and cracked lips. Laboratory tests show elevated inflammatory markers, including CRP and ESR, along with a thrombocytosis.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I25.1"
  },
  {
    "doctor_vignette": "An 18-year-old male presents with shortness of breath on exertion and persistent fatigue for the past month. On examination, he has bilateral lower extremity edema and elevated jugular venous pressure. Chest X-ray reveals cardiomegaly and pulmonary congestion, while lab tests show elevated B-type natriuretic peptide (BNP) levels.",
    "actual_diagnosis": "5. Congestive heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 31-year-old male presents with a chief complaint of increased thirst, frequent urination, and unexplained weight loss over the past month. Physical examination reveals dry mucous membranes and a body mass index of 22. Laboratory tests show a fasting blood glucose level of 250 mg/dL and ketones present in the urine.",
    "actual_diagnosis": "4. Type 1 diabetes mellitus, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 91-year-old male presents with a chief complaint of persistent back pain and increased difficulty with mobility over the past few months. On physical examination, he demonstrates significant kyphosis and tenderness over the thoracic spine. A DEXA scan reveals a T-score of -3.5, indicating severe osteoporosis. Additionally, a recent X-ray shows multiple vertebral fractures without acute trauma.",
    "actual_diagnosis": "7. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 142-year-old female presents with a chief complaint of itchy, red patches on her skin that have persisted for several weeks. Physical examination reveals well-defined, erythematous plaques with silvery scale predominantly on her elbows and knees. No significant abnormalities are noted in laboratory tests, and a skin biopsy confirms the diagnosis of psoriasis.",
    "actual_diagnosis": "6. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 48-year-old male presents with a chief complaint of severe pain and swelling in his right big toe that started suddenly overnight. On physical examination, there is notable erythema, warmth, and tenderness over the affected joint. Laboratory tests reveal an elevated serum uric acid level of 9.2 mg/dL and a joint aspiration shows needle-shaped monosodium urate crystals under polarized light microscopy.",
    "actual_diagnosis": "10. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with fatigue and persistent swelling in her ankles. On physical examination, she has elevated blood pressure and bilateral lower extremity edema. Laboratory results reveal a serum creatinine level of 2.1 mg/dL and a glomerular filtration rate (GFR) of 45 mL/min, indicating impaired kidney function.",
    "actual_diagnosis": "11. Chronic kidney disease, ICD-10 code N18.9"
  },
  {
    "doctor_vignette": "A 133-year-old female presents with joint swelling and bruising after a minor fall. Physical examination reveals significant hemarthrosis in the right knee and multiple ecchymoses on her extremities. Laboratory tests show a prolonged activated partial thromboplastin time (aPTT) with normal prothrombin time (PT) and low factor VIII levels.",
    "actual_diagnosis": "12. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 148-year-old female presents with worsening shortness of breath and a persistent cough for the past month. On examination, she has decreased breath sounds bilaterally, wheezing, and a prolonged expiration phase. A chest X-ray shows hyperinflation of the lungs, and spirometry reveals an FEV1/FVC ratio of 55%, confirming airflow limitation.",
    "actual_diagnosis": "15. Chronic obstructive pulmonary disease (COPD), ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 20-year-old male presents with a chief complaint of unintentional weight loss and increased heart rate over the past month. On physical examination, he exhibits fine tremors, heat intolerance, and a visibly enlarged thyroid gland. Laboratory tests reveal elevated free T4 and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "16. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 70-year-old female presents with social withdrawal and difficulty in communication. On physical exam, she exhibits repetitive hand movements and has difficulty maintaining eye contact. Neuropsychological testing reveals significant deficits in social cognition and adaptive functioning, consistent with autism spectrum disorder. No critical lab or imaging results are necessary as the diagnosis is primarily clinical based on behavioral observations.",
    "actual_diagnosis": "18. Autism spectrum disorder, ICD-10 code F84.0"
  },
  {
    "doctor_vignette": "A 149-year-old male presents to the emergency department with acute shortness of breath and swelling of the face and tongue after consuming a shellfish meal. On examination, he has wheezing, stridor, and hypotension with a blood pressure of 70/40 mmHg. A rapid bedside test shows elevated serum tryptase levels, indicating anaphylaxis. His oxygen saturation is 85% on room air.",
    "actual_diagnosis": "19. Anaphylactic shock, ICD-10 code T78.2"
  },
  {
    "doctor_vignette": "A 50-year-old female presents with a 2-day history of severe headache, fever, and neck stiffness. On examination, she exhibits photophobia and a positive Brudzinski's sign. A lumbar puncture reveals cloudy cerebrospinal fluid with a white blood cell count of 1,200 cells/mm³, predominantly neutrophils, and positive Gram stain for bacteria. Blood cultures are also positive for Streptococcus pneumoniae.",
    "actual_diagnosis": "Bacterial meningitis, ICD-10 code A39.9"
  },
  {
    "doctor_vignette": "A 117-year-old female presents with complaints of gradual enlargement of her hands and feet over the past few years, along with persistent headaches. Physical examination reveals pronounced facial features, including a protruding jaw and enlarged nose, along with thickened skin on her hands. Serum IGF-1 levels are significantly elevated, and an MRI shows a pituitary adenoma consistent with growth hormone excess.",
    "actual_diagnosis": "14. Acromegaly, ICD-10 code E22.0"
  },
  {
    "doctor_vignette": "A 125-year-old female presents with sudden onset of petechiae and purpura on her extremities, along with complaints of fatigue and confusion. Physical examination reveals a low-grade fever, splenomegaly, and significant pallor. Laboratory results show a markedly reduced platelet count of 20,000/µL, elevated lactate dehydrogenase (LDH) levels, and a negative Direct Coombs test, indicating hemolytic anemia. These findings are suggestive of thrombotic thrombocytopenic purpura.",
    "actual_diagnosis": "Thrombotic thrombocytopenic purpura, ICD-10 code D68.6"
  },
  {
    "doctor_vignette": "A 2-year-old female presents for a routine check-up with her parents who express concern about her increased irritability and poor feeding. Physical examination reveals elevated blood pressure of 110/70 mmHg, which is above the 95th percentile for her age. No signs of end-organ damage are noted, and laboratory tests show normal renal function and electrolytes. A follow-up echocardiogram is planned to assess for potential underlying causes.",
    "actual_diagnosis": "6. Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "An 108-year-old male presents with severe abdominal pain and nausea. Physical examination reveals tenderness in the epigastric region and mild jaundice. Laboratory tests show elevated serum amylase and lipase levels, and abdominal ultrasound indicates pancreatic edema with no evidence of gallstones.",
    "actual_diagnosis": "Pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 72-year-old male presents with persistent difficulties in maintaining focus and organization, often losing track of conversations and appointments. His mental status exam reveals distractibility and impulsive speech. No significant abnormalities are noted on neurological examination, and laboratory tests, including a CBC and metabolic panel, are within normal limits. Imaging studies show no structural abnormalities in the brain.",
    "actual_diagnosis": "12. Attention-deficit hyperactivity disorder, ICD-10 code F90.9"
  },
  {
    "doctor_vignette": "A 130-year-old male presents with persistent fatigue and weight gain over the past six months. Physical examination reveals dry skin, bradycardia, and a delayed deep tendon reflex. Laboratory tests show elevated TSH levels and low free T4, confirming the diagnosis.",
    "actual_diagnosis": "9. Hypothyroidism, ICD-10 code E03.9"
  },
  {
    "doctor_vignette": "A 19-year-old female presents with a chief complaint of persistent lower back pain after a minor fall. Physical examination reveals decreased lumbar lordosis and tenderness on palpation of the lumbar spine. A dual-energy X-ray absorptiometry (DEXA) scan shows a T-score of -2.5, indicating significant bone density loss. Laboratory tests reveal normal calcium and vitamin D levels, ruling out secondary causes of osteoporosis.",
    "actual_diagnosis": "13. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 97-year-old male presents with worsening shortness of breath and wheezing that has been persistent for the past week. On examination, he exhibits prolonged expiratory wheezes and diminished breath sounds on auscultation. A peak flow measurement reveals a marked decrease in expiratory flow rate. Chest X-ray shows hyperinflation consistent with asthma, with no signs of infection.",
    "actual_diagnosis": "15. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "An 118-year-old male presents with a chief complaint of a rapidly enlarging dark lesion on his right forearm. Physical examination reveals a 2.5 cm irregularly shaped, black and brown pigmented lesion with irregular borders and a rough surface. A biopsy shows malignant melanoma, and imaging reveals no regional lymphadenopathy or distant metastasis.",
    "actual_diagnosis": "14. Melanoma of the skin, ICD-10 code C43.9"
  },
  {
    "doctor_vignette": "A 99-year-old female presents with fatigue and decreased appetite over the past month. Physical examination reveals bilateral lower extremity edema and decreased urine output. Laboratory tests show elevated serum creatinine levels of 2.5 mg/dL and a glomerular filtration rate (GFR) of 30 mL/min, indicating impaired kidney function.",
    "actual_diagnosis": "17. Chronic kidney disease, ICD-10 code N18.9"
  },
  {
    "doctor_vignette": "A 27-year-old female presents with worsening shortness of breath and fatigue over the past month. On physical examination, she has elevated jugular venous pressure, bilateral lower extremity edema, and crackles noted on lung auscultation. A chest X-ray reveals cardiomegaly and pulmonary congestion, while BNP levels are significantly elevated.",
    "actual_diagnosis": "16. Congestive heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 77-year-old female presents with a chief complaint of persistent fatigue and joint pain, particularly in her hands and knees. On physical examination, she exhibits a malar rash across her cheeks, along with tenderness and swelling in multiple joints. Laboratory tests reveal a positive antinuclear antibody (ANA) test and elevated levels of anti-double-stranded DNA antibodies, consistent with autoimmune activity.",
    "actual_diagnosis": "18. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 33-year-old female presents with complaints of blurred vision and halos around lights. On examination, her intraocular pressure is measured at 28 mmHg, and a visual field test shows peripheral vision loss. Fundoscopic examination reveals cupping of the optic disc, indicating possible glaucoma.",
    "actual_diagnosis": "21. Glaucoma, ICD-10 code H40.9"
  },
  {
    "doctor_vignette": "A 73-year-old female presents with a chief complaint of widespread musculoskeletal pain and fatigue lasting over six months. On physical examination, she exhibits tenderness in multiple trigger points and has difficulty with range of motion due to pain. Laboratory tests show normal inflammatory markers and no abnormalities in routine blood work, ruling out other conditions.",
    "actual_diagnosis": "19. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 35-year-old male presents to the emergency department with palpitations and shortness of breath that started suddenly while exercising. On physical examination, his heart rate is irregularly irregular at 150 beats per minute, and he has mild dyspnea. An ECG shows atrial fibrillation with no identifiable P waves, and a chest X-ray reveals no acute cardiopulmonary abnormalities.",
    "actual_diagnosis": "22. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 109-year-old male presents with swelling and tenderness in his left leg. On physical exam, the left calf is markedly swollen and warm to the touch, with positive Homan's sign. Doppler ultrasound reveals a thrombus in the left popliteal vein. His medical history includes prolonged immobility following recent hospitalization for pneumonia.",
    "actual_diagnosis": "23. Deep vein thrombosis, ICD-10 code I82.409"
  },
  {
    "doctor_vignette": "A 133-year-old female presents to the emergency department with acute difficulty breathing and swelling of the face and throat after ingesting a peanut butter cookie. Physical exam reveals wheezing, facial edema, and hypotension. Laboratory tests show an elevated serum tryptase level and low oxygen saturation. Immediate treatment with epinephrine is initiated.",
    "actual_diagnosis": "25. Anaphylaxis, ICD-10 code T78.2"
  },
  {
    "doctor_vignette": "A 93-year-old female presents with recurrent bruising and prolonged bleeding from a minor laceration on her arm. Physical examination reveals multiple ecchymoses on her extremities and a slight pallor. Laboratory tests show aPTT of 60 seconds (normal 25-35 seconds) with normal PT, and a factor VIII level of 35% (normal 50-150%).",
    "actual_diagnosis": "24. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 66-year-old male presents with severe pain and swelling in his right big toe, which began suddenly two days ago. On physical examination, the affected joint is erythematous, warm, and tender to touch. Serum uric acid levels are significantly elevated at 9.2 mg/dL, confirming hyperuricemia.",
    "actual_diagnosis": "26. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 47-year-old male presents with complaints of numbness and tingling in his right hand, particularly affecting the thumb, index, and middle fingers. On physical examination, a positive Tinel's sign and Phalen's maneuver are noted, indicating median nerve compression. Nerve conduction studies reveal decreased sensory and motor conduction velocities across the wrist.",
    "actual_diagnosis": "27. Carpal tunnel syndrome, ICD-10 code G56.00"
  },
  {
    "doctor_vignette": "A 41-year-old female presents with a chief complaint of severe left lower abdominal pain and fever for the past two days. Physical examination reveals tenderness in the left lower quadrant with rebound tenderness and mild distension. A CT scan of the abdomen shows diverticula in the sigmoid colon with surrounding inflammatory changes, consistent with diverticulitis.",
    "actual_diagnosis": "28. Diverticulitis, ICD-10 code K57.9"
  },
  {
    "doctor_vignette": "A 101-year-old male presents with progressive lower back pain and difficulty walking, particularly after short distances. On physical exam, he exhibits diminished lower extremity reflexes and a positive straight leg raise test. MRI of the lumbar spine reveals significant narrowing of the spinal canal at L4-L5 due to degenerative changes. His history includes osteoarthritis and chronic pain management.",
    "actual_diagnosis": "29. Spinal stenosis, ICD-10 code M48.0"
  },
  {
    "doctor_vignette": "A 133-year-old female presents with complaints of progressive enlargement of her hands and feet over the past several years. On physical examination, notable findings include pronounced facial features, including a protruding jaw and enlarged nasal features, as well as thickened skin on her palms. An MRI of the pituitary gland reveals a sizable adenoma, and serum growth hormone levels are markedly elevated. ",
    "actual_diagnosis": "30. Acromegaly, ICD-10 code E22.0"
  },
  {
    "doctor_vignette": "A 43-year-old male presents with a chief complaint of persistent abdominal pain and diarrhea lasting for several weeks. Physical examination reveals tenderness in the right lower quadrant and signs of weight loss. Laboratory tests show elevated C-reactive protein (CRP) and anemia, while a colonoscopy reveals skip lesions and deep ulcers in the ileum.",
    "actual_diagnosis": "Crohn's disease, ICD-10 code K50.9"
  },
  {
    "doctor_vignette": "A 73-year-old female presents with a chief complaint of persistent right upper quadrant pain that worsens after meals. On physical examination, she has tenderness in the right upper abdomen and a positive Murphy's sign. An abdominal ultrasound reveals multiple gallstones in the gallbladder, with no signs of acute cholecystitis.",
    "actual_diagnosis": "Cholelithiasis (gallstones), ICD-10 code K80.9"
  },
  {
    "doctor_vignette": "A 32-year-old male presents with a chief complaint of multiple skin lesions and increasing headaches. Physical examination reveals café-au-lait spots on his torso, axillary freckling, and subcutaneous neurofibromas on his arms. MRI of the brain shows the presence of an optic nerve glioma, consistent with neurofibromatosis type 1.",
    "actual_diagnosis": "Neurofibromatosis, ICD-10 code Q85.0"
  },
  {
    "doctor_vignette": "A 150-year-old female presents with complaints of unintentional weight loss and increased heart rate. On physical examination, she exhibits tremors in her hands, a warm and moist skin texture, and bulging eyes. Laboratory results reveal elevated serum thyroxine (T4) levels and suppressed thyroid-stimulating hormone (TSH) levels.",
    "actual_diagnosis": "9. Hyperthyroidism, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 34-year-old male presents with a chief complaint of persistent cough and shortness of breath for the past week. Physical examination reveals decreased breath sounds in the right lower lung field and crackles on auscultation. A chest X-ray shows right lower lobe consolidation, and a PCR test for SARS-CoV-2 is positive.",
    "actual_diagnosis": "Pneumonia due to coronavirus, ICD-10 code J12.81"
  },
  {
    "doctor_vignette": "An 108-year-old female presents with a chief complaint of persistent knee pain and stiffness, particularly worsening in the morning. Physical examination reveals crepitus and limited range of motion in both knees, along with tenderness on palpation. X-rays show joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "7. Osteoarthritis, ICD-10 code M15.9"
  },
  {
    "doctor_vignette": "A 55-year-old female presents with a chief complaint of severe pain in her right big toe that started suddenly overnight. On physical examination, the toe is red, swollen, and tender to touch, with a limited range of motion. Lab results reveal elevated serum uric acid levels of 8.5 mg/dL, and a joint aspiration shows the presence of monosodium urate crystals.",
    "actual_diagnosis": "11. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with worsening shortness of breath and wheezing over the past week, particularly at night. On physical examination, he exhibits diffuse wheezing and decreased breath sounds bilaterally. A peak flow measurement shows a significant reduction from his baseline, and a chest X-ray reveals no acute pathology. His history includes smoking for 30 years and a previous diagnosis of allergic rhinitis.",
    "actual_diagnosis": "14. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 121-year-old male presents with fatigue and decreased urine output over the past week. Physical examination reveals dry mucous membranes and mild edema in the lower extremities. Laboratory results indicate elevated serum creatinine levels at 3.2 mg/dL and a BUN of 45 mg/dL, with urinalysis showing no signs of obstruction. Ultrasound of the kidneys shows normal size with no hydronephrosis.",
    "actual_diagnosis": "12. Acute kidney injury, ICD-10 code N17.9"
  },
  {
    "doctor_vignette": "A 71-year-old female presents to the emergency department with palpitations and shortness of breath that started 2 hours ago. On physical examination, her heart rate is irregularly irregular at 120 beats per minute, and she exhibits mild edema in her lower extremities. An ECG shows atrial fibrillation with a rapid ventricular response, and her electrolytes reveal hypokalemia.",
    "actual_diagnosis": "15. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "An 81-year-old male presents with increasing memory loss over the past year, frequently forgetting recent conversations and misplacing items. On physical examination, he demonstrates difficulty with short-term recall and appears disoriented to time. Neuroimaging reveals moderate cerebral atrophy with significant hippocampal involvement. Laboratory tests show normal thyroid function and vitamin B12 levels.",
    "actual_diagnosis": "17. Alzheimer's disease, ICD-10 code G30.9"
  },
  {
    "doctor_vignette": "A 37-year-old female presents with a chief complaint of persistent itchy rash on her elbows and knees. Physical examination reveals erythematous, scaly patches with excoriations and lichenification. No laboratory tests are necessary as the diagnosis is based on clinical findings, which are consistent with eczema.",
    "actual_diagnosis": "20. Eczema, ICD-10 code L30.9"
  },
  {
    "doctor_vignette": "A 13-year-old female presents with a chief complaint of persistent skin tightening and swelling on her fingers and face over the past six months. Physical examination reveals sclerodactyly, telangiectasia on her cheeks, and decreased range of motion in her fingers. Laboratory tests show a positive anti-Scl-70 antibody and elevated ESR, indicating systemic involvement.",
    "actual_diagnosis": "21. Systemic sclerosis, ICD-10 code M34.9"
  },
  {
    "doctor_vignette": "A 126-year-old male presents with severe anemia and recurrent pain episodes in his chest and joints. Physical examination reveals pallor, splenomegaly, and tenderness in the lower extremities. Laboratory results show a hemoglobin level of 7 g/dL, with a peripheral blood smear indicating sickle-shaped cells and reticulocytosis. Additionally, elevated bilirubin levels suggest hemolysis.",
    "actual_diagnosis": "18. Sickle cell disease, ICD-10 code D57.9"
  },
  {
    "doctor_vignette": "A 3-year-old female presents with severe abdominal pain and vomiting. On physical examination, she exhibits tenderness in the epigastric region and rebound tenderness. Laboratory tests reveal elevated serum lipase levels and a CT scan shows peritoneal fluid consistent with pancreatitis. The child has a history of recent high-fat dietary intake.",
    "actual_diagnosis": "22. Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 142-year-old male presents with acute left lower quadrant abdominal pain and fever. Physical examination reveals tenderness and guarding in the left lower abdomen, with decreased bowel sounds. A CT scan of the abdomen shows multiple diverticula with associated inflammation, confirming the diagnosis.",
    "actual_diagnosis": "23. Diverticulitis, ICD-10 code K57.9"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with progressive muscle weakness, particularly in her eyelids and limbs, worsening with activity. Physical examination reveals ptosis and bilateral weakness in the proximal muscles. A repetitive nerve stimulation test shows a significant decremental response, and serum acetylcholine receptor antibodies are elevated.",
    "actual_diagnosis": "24. Myasthenia gravis, ICD-10 code G70.00"
  },
  {
    "doctor_vignette": "A 104-year-old male presents with prolonged bleeding from a minor cut on his forearm that has not stopped after several hours. On physical examination, there are multiple ecchymoses on his extremities and a notable pallor. Laboratory tests reveal a significantly decreased Factor VIII level and an elevated activated partial thromboplastin time (aPTT), consistent with hemophilia A.",
    "actual_diagnosis": "25. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 129-year-old male presents with a chief complaint of acute shortness of breath and cough. Physical examination reveals decreased breath sounds and crackles in the right lower lung field. Chest X-ray shows right lower lobe consolidation, and sputum analysis indicates the presence of aspirated material. ",
    "actual_diagnosis": "Pneumonia due to aspiration, ICD-10 code J69.0"
  },
  {
    "doctor_vignette": "A 47-year-old male presents with auditory hallucinations and disorganized speech, expressing paranoid delusions about being watched. Physical examination reveals a flat affect and poor personal hygiene. Neurological examination is unremarkable, and routine lab tests, including a complete blood count and metabolic panel, show no abnormalities. A CT scan of the brain is normal, ruling out organic causes.",
    "actual_diagnosis": "20. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 40-year-old male presents with progressive dyspnea on exertion and a persistent dry cough for the past six months. On physical examination, clubbing of the fingers and crackles are noted upon auscultation of the lungs. High-resolution CT scan reveals reticular opacities and ground-glass opacities consistent with interstitial lung disease. Pulmonary function tests indicate a restrictive pattern with decreased forced vital capacity.",
    "actual_diagnosis": "Pulmonary fibrosis, ICD-10 code J84.10"
  },
  {
    "doctor_vignette": "An 11-year-old male presents with a chief complaint of neck pain and swelling for the past week. On physical examination, there is notable tenderness and enlargement of the thyroid gland, accompanied by mild fever and fatigue. Laboratory tests reveal elevated thyroid peroxidase antibodies and a slightly increased TSH level, indicating thyroid inflammation.",
    "actual_diagnosis": "Thyroiditis, ICD-10 code E06.9"
  },
  {
    "doctor_vignette": "A 26-year-old male presents with a chief complaint of widespread itching and raised welts on his arms and torso that appeared suddenly after eating shellfish. Physical examination reveals multiple erythematous wheals varying in size, with no signs of angioedema or respiratory distress. Laboratory tests show elevated eosinophil count and normal skin biopsy results, ruling out other conditions.",
    "actual_diagnosis": "Urticaria, ICD-10 code L50.9"
  },
  {
    "doctor_vignette": "A 6-year-old male presents with a chief complaint of persistent cough and difficulty breathing for the past month. On physical examination, he exhibits tachypnea, digital clubbing, and crackles on auscultation. A high-resolution CT scan of the chest reveals ground-glass opacities and reticular patterns consistent with interstitial lung disease.",
    "actual_diagnosis": "Interstitial lung disease, ICD-10 code J84.112"
  },
  {
    "doctor_vignette": "A 63-year-old female presents with a chief complaint of easy bruising and petechiae on her lower extremities. Physical examination reveals multiple ecchymoses and scattered petechiae, with no signs of splenomegaly. Laboratory tests show a markedly low platelet count of 40,000/mm³, while other blood counts remain normal.",
    "actual_diagnosis": "Idiopathic thrombocytopenic purpura, ICD-10 code D69.3"
  },
  {
    "doctor_vignette": "A 29-year-old male presents with a chief complaint of worsening headaches and visual disturbances. On physical examination, multiple café-au-lait spots and several palpable neurofibromas are noted on his torso and limbs. MRI of the brain reveals an optic nerve glioma, consistent with his condition.",
    "actual_diagnosis": "Neurofibromatosis type 1, ICD-10 code Q85.01"
  },
  {
    "doctor_vignette": "A 116-year-old female presents with high fever, chills, and severe fatigue over the past week. Physical examination reveals splenomegaly and pallor. Laboratory tests show a positive rapid diagnostic test for Plasmodium species and a hemoglobin level of 8 g/dL, indicating anemia.",
    "actual_diagnosis": "Malaria, ICD-10 code B50.9"
  },
  {
    "doctor_vignette": "A 127-year-old female presents with recurrent episodes of unresponsiveness and jerking movements of her left arm, occurring approximately twice a week. Neurological examination reveals slight weakness on the right side and a postictal state following the episodes. An EEG shows diffuse slow-wave activity suggestive of seizure activity, while MRI of the brain is unremarkable. ",
    "actual_diagnosis": "Epilepsy, unspecified, ICD-10 code G40.909"
  },
  {
    "doctor_vignette": "A 104-year-old male presents with persistent pain in his right knee, which worsens with activity and improves with rest. On physical examination, there is notable crepitus upon movement, tenderness along the joint line, and a reduced range of motion. X-rays reveal joint space narrowing, osteophyte formation, and subchondral sclerosis consistent with osteoarthritis.",
    "actual_diagnosis": "Osteoarthritis of the knee, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 125-year-old male presents with fatigue and decreased appetite. Physical examination reveals mild edema in the lower extremities and hypertension with a blood pressure of 150/90 mmHg. Laboratory results show an elevated serum creatinine level of 2.5 mg/dL and a glomerular filtration rate (GFR) of 45 mL/min, indicating stage 3 chronic kidney disease.",
    "actual_diagnosis": "Chronic kidney disease, stage 3, ICD-10 code N18.30"
  },
  {
    "doctor_vignette": "A 124-year-old female presents with fatigue and jaundice. On physical examination, she has scleral icterus and mild abdominal tenderness. Laboratory tests reveal elevated alanine aminotransferase (ALT) and aspartate aminotransferase (AST) levels, along with a positive hepatitis C antibody test.",
    "actual_diagnosis": "Hepatitis C, ICD-10 code B17.10"
  },
  {
    "doctor_vignette": "A 136-year-old female presents with a chief complaint of severe swelling in her legs and abdomen for the past week. On physical examination, she demonstrates pitting edema in the lower extremities and ascites. Laboratory tests reveal significant proteinuria of 4.5 g/day and hypoalbuminemia with serum albumin levels at 2.1 g/dL. Urinalysis shows the presence of fatty casts.",
    "actual_diagnosis": "Nephrotic syndrome, ICD-10 code N04.9"
  },
  {
    "doctor_vignette": "A 15-year-old female presents with fatigue and abdominal discomfort. Physical examination reveals mild hepatomegaly and tenderness in the right upper quadrant. Liver function tests show elevated alanine aminotransferase (ALT) and aspartate aminotransferase (AST) levels, while an abdominal ultrasound reveals increased echogenicity of the liver consistent with fatty infiltration.",
    "actual_diagnosis": "Nonalcoholic fatty liver disease, ICD-10 code K76.0"
  },
  {
    "doctor_vignette": "A 77-year-old male presents with a chief complaint of severe headache and confusion for the past two days. On examination, he is febrile with a stiff neck and photophobia, and he exhibits altered mental status. Lumbar puncture reveals cloudy cerebrospinal fluid with elevated white blood cell count and a predominance of neutrophils, indicating a possible bacterial infection.",
    "actual_diagnosis": "Bacterial meningitis, unspecified, ICD-10 code G00.9"
  },
  {
    "doctor_vignette": "A 40-year-old female presents with persistent numbness and tingling in her right hand, particularly in the thumb, index, and middle fingers. On physical examination, she exhibits positive Phalen's and Tinel's signs. Nerve conduction studies reveal slowed median nerve conduction across the wrist, confirming the diagnosis.",
    "actual_diagnosis": "Carpal tunnel syndrome, ICD-10 code G56.01"
  },
  {
    "doctor_vignette": "A 30-year-old female presents to the emergency department with acute chest pain radiating to her left arm, accompanied by shortness of breath and diaphoresis. On physical examination, she exhibits tachycardia and a blood pressure of 90/60 mmHg. An ECG shows ST-segment elevation in the anterior leads, and cardiac troponin levels are significantly elevated. These findings are consistent with myocardial infarction.",
    "actual_diagnosis": "Acute myocardial infarction, unspecified, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 110-year-old female presents with a chief complaint of persistent fever lasting over five days. Physical exam reveals conjunctival injection, a rash on the trunk, and significant cervical lymphadenopathy. Laboratory tests show elevated inflammatory markers (ESR and CRP) and thrombocytosis. Echocardiogram indicates coronary artery dilation.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I00"
  },
  {
    "doctor_vignette": "A 103-year-old female presents with a chief complaint of chronic constipation and abdominal distension. Physical exam reveals a markedly distended abdomen with palpable fecal impaction and a lack of bowel sounds. Abdominal X-ray shows significant colonic dilation and a transition zone indicative of Hirschsprung disease. No other acute findings are noted.",
    "actual_diagnosis": "Hirschsprung disease, ICD-10 code Q43.1"
  },
  {
    "doctor_vignette": "A 127-year-old female presents with recurrent episodes of syncope and palpitations. Upon examination, she demonstrates a characteristic coved-type ST-segment elevation in leads V1 to V3 on her ECG. Her family history is notable for sudden cardiac death in a male relative at a young age. Laboratory tests reveal no significant electrolyte imbalances.",
    "actual_diagnosis": "Brugada syndrome, ICD-10 code I45.81"
  },
  {
    "doctor_vignette": "An 84-year-old female presents with a chief complaint of a rash and fever for the past week. Physical examination reveals an erythema migrans rash on her left thigh, along with bilateral knee swelling and tenderness. Laboratory tests show positive serology for Borrelia burgdorferi, confirming Lyme disease.",
    "actual_diagnosis": "Lyme disease, ICD-10 code A69.20"
  },
  {
    "doctor_vignette": "An 80-year-old male presents with a 2-day history of a barking cough, hoarseness, and difficulty breathing. On examination, he has stridor at rest and appears anxious, with a respiratory rate of 28 breaths per minute. A neck X-ray shows mild subglottic narrowing consistent with croup. No significant lab abnormalities are noted, but oxygen saturation is 92% on room air.",
    "actual_diagnosis": "Croup, ICD-10 code J05.0"
  },
  {
    "doctor_vignette": "A 139-year-old male presents with a chief complaint of severe headache and neck stiffness. Upon examination, he exhibits fever, photophobia, and a positive Brudzinski's sign. Lumbar puncture reveals elevated white blood cell count with a predominance of neutrophils and low glucose levels, indicating a possible bacterial infection.",
    "actual_diagnosis": "Bacterial meningitis, ICD-10 code A37.9"
  },
  {
    "doctor_vignette": "A 149-year-old male presents with persistent bone pain and swelling in the left mandible. Physical examination reveals tenderness and a palpable mass in the affected area, along with skin lesions resembling seborrheic keratosis. CT imaging shows lytic bone lesions in the skull and mandible, while biopsy of the skin lesions confirms the presence of Langerhans cells. Laboratory tests indicate elevated levels of serum uric acid and a mild leukocytosis.",
    "actual_diagnosis": "Langerhans cell histiocytosis, ICD-10 code D75.81"
  },
  {
    "doctor_vignette": "A 9-year-old male presents with a chief complaint of severe pain and swelling in his right big toe. On physical examination, the toe is erythematous, swollen, and exhibits limited range of motion. Laboratory tests reveal elevated serum uric acid levels of 8.5 mg/dL. Joint aspiration shows needle-shaped crystals under polarized light, confirming the diagnosis.",
    "actual_diagnosis": "Gouty arthritis, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 59-year-old female presents with a chief complaint of diminished sexual satisfaction and difficulty achieving orgasm. Physical examination reveals decreased pelvic floor muscle tone and signs of vaginal atrophy. Laboratory tests show elevated FSH and LH levels, indicating menopausal changes. There are no signs of urinary tract infection on urinalysis.",
    "actual_diagnosis": "Erectile dysfunction, ICD-10 code N52.9"
  },
  {
    "doctor_vignette": "A 133-year-old male presents with complaints of hot flashes and mood swings, which he describes as increasingly bothersome over the past few months. Physical examination reveals a lack of secondary sexual characteristics and notable weight gain. Hormonal panel shows elevated follicle-stimulating hormone (FSH) levels and decreased testosterone levels, indicative of hormonal changes typically associated with menopause in males. Imaging studies are unremarkable.",
    "actual_diagnosis": "Menopause, ICD-10 code N95.1"
  },
  {
    "doctor_vignette": "A 19-year-old male presents with progressive cognitive decline, difficulty concentrating, and visual hallucinations over the past three months. Physical examination reveals a tremor in the right hand and rigidity in both upper extremities. Neuroimaging shows cortical atrophy and a decrease in dopamine transporter uptake on SPECT scan, consistent with Lewy body pathology.",
    "actual_diagnosis": "Dementia with Lewy bodies, ICD-10 code G31.83"
  },
  {
    "doctor_vignette": "A 79-year-old female presents with a chief complaint of excessive hand washing and persistent thoughts that she may have contaminated surfaces in her home. Physical examination reveals no significant abnormalities, but she appears anxious and exhibits repetitive behaviors. No critical lab or imaging results are necessary for diagnosis, as her symptoms are consistent with obsessive-compulsive disorder.",
    "actual_diagnosis": "Obsessive-compulsive disorder, ICD-10 code F42"
  },
  {
    "doctor_vignette": "A 117-year-old female presents with a chief complaint of increasing shortness of breath and a persistent cough for the past month. Physical examination reveals prolonged expiratory phase, wheezing, and use of accessory muscles for respiration. Chest X-ray shows hyperinflation and a flattened diaphragm, while spirometry reveals a FEV1/FVC ratio of 55%, consistent with obstructive lung disease.",
    "actual_diagnosis": "1. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 71-year-old male presents with increased thirst and frequent urination over the past month. On physical examination, he is found to have dry skin and a high respiratory rate. Laboratory results reveal a fasting blood glucose level of 250 mg/dL and HbA1c of 9.5%. Ketones are present in his urine, indicating potential diabetic ketoacidosis.",
    "actual_diagnosis": "2. Type 1 diabetes mellitus, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 107-year-old female presents with persistent fatigue and a rash on her face that resembles a butterfly shape. Physical examination reveals joint swelling in her hands and a low-grade fever. Laboratory tests show elevated antinuclear antibodies (ANA) and a positive anti-double-stranded DNA test, confirming autoimmune activity.",
    "actual_diagnosis": "4. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 99-year-old male presents to the emergency department with acute chest pain radiating to his left arm and shortness of breath. On physical examination, he is diaphoretic, with a blood pressure of 90/60 mmHg and a heart rate of 110 bpm. An ECG shows ST-segment elevation in the anterior leads, and cardiac troponin levels are markedly elevated. His history includes hypertension and a prior myocardial infarction.",
    "actual_diagnosis": "3. Acute myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with exertional dyspnea and fatigue. On examination, he has elevated blood pressure of 160/100 mmHg, a left ventricular heave, and an S4 gallop rhythm. An echocardiogram reveals left ventricular hypertrophy, and his B-type natriuretic peptide (BNP) level is elevated at 300 pg/mL.",
    "actual_diagnosis": "5. Hypertensive heart disease, ICD-10 code I11.9"
  },
  {
    "doctor_vignette": "A 39-year-old male presents with a chief complaint of shortness of breath and wheezing that worsens at night and with exercise. Physical examination reveals expiratory wheezes and prolonged expiratory phase on auscultation. Spirometry shows a reduced FEV1/FVC ratio, indicating airflow obstruction that improves with bronchodilator administration.",
    "actual_diagnosis": "6. Asthma, unspecified, ICD-10 code J45.909"
  }
]